#請搜尋[每次填報更改]來更改內容

rm(list=ls())

# 載入所需套件
#隱藏警告訊息
suppressWarnings({
  suppressPackageStartupMessages({
  library(DBI)
  library(odbc)
  library(magrittr)
  library(dplyr)
  library(readxl)
  library(stringr)
  library(openxlsx)
  library(tidyr)
  library(reshape2)
  })
})

time_now <- Sys.time()

#[每次填報更改]請輸入本次填報設定檔標題(字串需與標題完全相符，否則會找不到)
title <- "113學年度下學期高級中等學校教育人力資源資料庫（直轄市立及縣市立學校人事）"

#[每次填報更改]請更改自己管區的學校代碼
dis <- c(
  "313301", 
  "313302", 
  "323301", 
  "323302", 
  "323401", 
  "323402", 
  "333301", 
  "333304", 
  "333401", 
  "343301", 
  "343302", 
  "343303", 
  "353301", 
  "353302", 
  "353303", 
  "363301", 
  "363302", 
  "373301", 
  "373302", 
  "383301", 
  "383302", 
  "383303", 
  "383401", 
  "393301", 
  "393302", 
  "393401", 
  "403301", 
  "403302", 
  "403303", 
  "403401", 
  "413301", 
  "413302", 
  "413401", 
  "423301", 
  "423302", 
  "033302", 
  "033304", 
  "033306", 
  "033316", 
  "033325", 
  "033327", 
  "033407", 
  "033408", 
  "034306", 
  "034312", 
  "034314", 
  "034319", 
  "034332", 
  "034335", 
  "034347", 
  "034348", 
  "034399", 
  "074308", 
  "074313", 
  "074323", 
  "074328", 
  "074339", 
  "084309", 
  "173304", 
  "173306", 
  "173307", 
  "173314", 
  "144322"
  )

checkfile_server <- "\\\\192.168.110.245\\Plan_edhr\\教育部高級中等學校教育人力資源資料庫建置第8期計畫(1130801_1140731)\\9. 檢核語法檔\\R\\自動化資料檢核結果\\edhr-113t2-check_print.xlsx" #[每次填報更改]請更改本次server匯出的檢核結果檔之路徑
check02_server <- readxl :: read_excel(checkfile_server)

#審核同意的名單 = check02_server subset自己管區學校的名單
list_agree <- check02_server %>% 
  select("organization_id") %>% 
  subset(organization_id %in% dis) %>% 
  mutate(agree = 1)

#載入server端產出的檢核結果excel檔
check02 <- check02_server %>%
  subset(organization_id %in% dis)

#[每次填報更改]以下個案處理請依自己實際需求修改
# 計畫端個案處理 -------------------------------------------------------------------

# #國立中央大學附屬中壢高中(030305)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：152人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：151；差異百分比-0.7%" & check02$organization_id == "030305", "", check02$flag95)
# 
# #國立北科大附屬桃園農工(030403)
#   #資源班 服務單位正確
# check02$flag49 <- if_else(check02$flag49 != "" & check02$organization_id == "030403", "", check02$flag49)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：206人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：212；差異百分比2.8%" & check02$organization_id == "030403", "", check02$flag95)
#   #同等學力
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：歐奕廷（副學士或專科畢業學校（一）：同等學歷）" & check02$organization_id == "030403", "", check02$spe6)
# 
# #市立龍潭高中(033302)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：118人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：128；差異百分比7.8%" & check02$organization_id == "033302", "", check02$flag95)
# 
# #市立桃園高中(033304)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：160人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：169；差異百分比5.3%" & check02$organization_id == "033304", "", check02$flag95)
#   #憲兵專科 正確
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：周芷恆（副學士或專科畢業科系（一）：憲兵專科）" & check02$organization_id == "033304", "", check02$spe6)
# 
# #市立武陵高中(033306)
#   #吳文村 謝東甫 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：吳文村 謝東甫（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "033306", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：163人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：165；差異百分比1.2%" & check02$organization_id == "033306", "", check02$flag95)
# 
# #市立楊梅高中(033316)
#   #彭美惠 112/04離職 去年教員資料表沒刪掉應刪掉
# check02$flag86 <- if_else(check02$flag86 == "姓名：彭美惠（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "033316", "", check02$flag86)
#   #伍韻璇 李利時 李鈺勳 林宜瑩 莊睿寧 薛智文 蘇婷亭 謝興隆 陳龍昇 確實為上學年度離退教職員工
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 伍韻璇 李利時 李鈺勳 林宜瑩 莊睿寧 薛智文 蘇婷亭 謝興隆 陳龍昇（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "033316", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：131人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：131；差異百分比0.0%" & check02$organization_id == "033316", "", check02$flag95)
# 
# #市立陽明高中(033325)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：151人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：151；差異百分比0.0%" & check02$organization_id == "033325", "", check02$flag95)
# 
# #市立內壢高中(033327)
#   #王心漪 吳思霈 林孟融 陳賢明 黃俊翔 黃慧娘 謝昇如 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "033327", "", check02$flag86)
#   #王炎川(上期flag86) 李宜安(112/08/01調校)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 李宜安 王炎川（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "033327", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：144人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：145；差異百分比0.7%" & check02$organization_id == "033327", "", check02$flag95)
# 
# #市立中壢高商(033407)
#   #朱怡君 林穗岑 王建岳 王瑞貞 范錫卿 賴思勻 郭鴻淇 陳俊仁 陳元春 章淑枝 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：朱怡君 林穗岑 王建岳 王瑞貞 范錫卿 賴思勻 郭鴻淇 陳俊仁 陳元春 章淑枝（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "033407", "", check02$flag86)
#   #劉素玲 周秀英 林均桓 林月霞 湯孟瑜 蕭永福 蘇鴻銘 鄭書季 陳柏臻 陳錦昌(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 劉素玲 周秀英 林均桓 林月霞 湯孟瑜 蕭永福 蘇鴻銘 鄭書季 陳柏臻 陳錦昌（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "033407", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：151人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：157；差異百分比3.8%" & check02$organization_id == "033407", "", check02$flag95)
#   #彭美珍（學士學位畢業學校（一）：國立臺北商業技術學院附設空中學校） 正確
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：彭美珍（學士學位畢業學校（一）：國立臺北商業技術學院附設空中學校）" & check02$organization_id == "033407", "", check02$spe6)
# 
# #市立中壢家商(033408)
#   #陳昱希16歲，但學校工作總年資有0年（約16歲開始工作） 正確
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，職員(工)資料表：陳昱希17歲，但學校工作總年資有1年（約16歲開始工作）" & check02$organization_id == "033408", "", check02$flag39)
#   #呂美娥 周美雪 林雅月 龔月速 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "033408", "", check02$flag86)
#   #謝鈺釵 鄭旭助(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 謝鈺釵 鄭旭助（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "033408", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：80人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：81；差異百分比1.2%" & check02$organization_id == "033408", "", check02$flag95)
#   #國立中山大學 教育研究所教師在職進修教學及學校行政碩士學位班、國立政治大學	學校行政碩士在職專班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：伍展儀（碩士學位畢業系所（一）：教育研究所教師在職進修教學及學校行政碩士學位班） 黃挹芬（碩士學位畢業系所（一）：學校行政碩士在職專班）" & check02$organization_id == "033408", "", check02$spe6)
# 
# #市立南崁高中(034306)
#   #Andrew Ethan Miller 紀加恩 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "034306", "", check02$flag86)
#   #呂靜葉(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 呂靜葉（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "034306", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：102人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：111；差異百分比8.1%" & check02$organization_id == "034306", "", check02$flag95)
#   #國立彰化師範大學	輔導與諮商學系學校輔導與諮商組、國立臺灣師範大學	教育學系學校行政班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：何思穎（學士學位畢業科系（一）：輔導與諮商學系學校輔導與諮商組） 陳家祥（碩士學位畢業系所（一）：教育學系學校行政班）" & check02$organization_id == "034306", "", check02$spe6)
# 
# #市立大溪高中(034312)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：80人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：83；差異百分比3.6%" & check02$organization_id == "034312", "", check02$flag95)
#   #國立政治大學	學校行政碩士在職專班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：蕭英全（碩士學位畢業系所（一）：學校行政碩士在職專班）" & check02$organization_id == "034312", "", check02$spe6)
# 
# #市立壽山高中(034314)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：143人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：138；差異百分比-3.6%" & check02$organization_id == "034314", "", check02$flag95)
#   #張云孆 黃政揚 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：張云孆 黃政揚（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "034314", "", check02$flag86)
#   # #   #黃麗娥 黄麗娥
# # # check02$flag98 <- if_else(check02$flag98 == "教員資料表：請確認該員基本資料：黃麗娥（姓名）" & check02$organization_id == "034314", "", check02$flag98)
#   #國立政治大學	學校行政碩士 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：呂雅惠（碩士學位畢業系所（一）：學校行政碩士）" & check02$organization_id == "034314", "", check02$spe6)
# 
# #市立平鎮高中(034319)
#   #教師李麗滿，112/08/01以專任身分退休，112/09/30改聘兼任，故上期(1121)資料為兼任的教師，本期(1131)填列在離退表
# check02$flag84 <- if_else(check02$flag84 == "教員：李麗滿（查貴校上一學年所填資料，上述人員聘任類別非屬『專任』。依欄位說明，非專任教職員(工)之退休或離職者，不須填列離退教職員(工)資料表，請務必再確認。）" & check02$organization_id == "034319", "", check02$flag84)
#   #曾偉誠 陳培文 馬海琴 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：曾偉誠 陳培文 馬海琴（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "034319", "", check02$flag86)
#   #何玉雲 劉得琪 周樂正 洪郁發 游正祥 黃思蕾(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 何玉雲 劉得琪 周樂正 洪郁發 游正祥 黃思蕾（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "034319", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：124人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：121；差異百分比-2.5%" & check02$organization_id == "034319", "", check02$flag95)
# 
# #市立觀音高中(034332)
#   #林晏儀 陳彥合 陳柏蓁 葉軒均 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "034332", "", check02$flag86)
#   #吳昌益 李嘉琳 周小貞 林曉筠 范姜綺君 陳羿筑 黃祥寧 鄧雅云 皆在上期基準日前離職
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "034332", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：137人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：145；差異百分比5.5%" & check02$organization_id == "034332", "", check02$flag95)
# 
# #市立新屋高級中等學校(034335)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：114人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：120；差異百分比5.0%" & check02$organization_id == "034335", "", check02$flag95)
# 
# #市立永豐高中(034347)
# # #   #伍慧美 林益儒 陳銘軍 黃郁文 皆非本學期退休或因故離職人員
# # # check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "034347", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：188人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：196；差異百分比4.1%" & check02$organization_id == "034347", "", check02$flag95)
#   #政治作戰學校	美術專科 正確
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：陳慶明（副學士或專科畢業科系（一）：美術專科）" & check02$organization_id == "034347", "", check02$spe6)
# 
# #市立羅浮高中(034348)
#   #人事室主管 暫缺 10/1已補人事主任
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "034348", "", check02$flag1)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：54人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：31；差異百分比-74.2%" & check02$organization_id == "034348", "", check02$flag95)
#   #聘任訖日確實為校長的聘約日期
# check02$flag102 <- if_else(check02$flag102 == "教員資料表：邱嘉增（1220731）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "034348", "", check02$flag102)
# 
# #市立大園國際高中(034399)
#   #國際交流處 113/08新設立 正確
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "034399", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：115人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：116；差異百分比0.9%" & check02$organization_id == "034399", "", check02$flag95)
# 
# #國立彰化女中(070301)
#   #柯雅雯 謝嫣霜 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：柯雅雯 謝嫣霜（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "070301", "", check02$flag86)
#   #邱世忠(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 邱世忠（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "070301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：109人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：116；差異百分比6.0%" & check02$organization_id == "070301", "", check02$flag95)
# 
# #國立員林高中(070304)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：120人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：123；差異百分比2.4%" & check02$organization_id == "070304", "", check02$flag95)
# 
# #國立彰化高中(070307)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "070307", "", check02$flag80)
#   #楊博修 葉敏達 葉秋芳 蘇盈嘉 賴双凰 鄭經獻 陳絹惠 黃彥霖 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：楊博修 葉敏達 葉秋芳 蘇盈嘉 賴双凰 鄭經獻 陳絹惠 黃彥霖（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "070307", "", check02$flag86)
#   #陳建良 上期基準日前離職
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 陳建良（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "070307", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：152人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：148；差異百分比-2.7%" & check02$organization_id == "070307", "", check02$flag95)
#   #聘任訖日確實為專任代理教師簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "070307", "", check02$flag102)
#   #碩士學位畢業學校（一）：德國維爾茨堡 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：張芸嫚（碩士學位畢業學校（一）：德國維爾茨堡）" & check02$organization_id == "070307", "", check02$spe6)
# 
# #國立鹿港高中(070316)
#   #蔡奉育56歲，但學校工作總年資有40年（約16歲開始工作） 正確
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，職員(工)資料表：蔡奉育56歲，但學校工作總年資有40年（約16歲開始工作）" & check02$organization_id == "070316", "", check02$flag39)
#   #莊浥慬 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：莊浥慬（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "070316", "", check02$flag86)
#   #粘菀真( 上期基準日前離職(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 粘菀真（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "070316", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：112人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：112；差異百分比0.0%" & check02$organization_id == "070316", "", check02$flag95)
# 
# #國立溪湖高中(070319)
#   #沒有設置學程主任
# check02$flag3 <- if_else(check02$flag3 == "請學校確認是否設置學程主任" & check02$organization_id == "070319", "", check02$flag3)
#   #方建富 林志彥 王淑靜 鄒采蓉 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：方建富 林志彥 王淑靜 鄒采蓉（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "070319", "", check02$flag86)
#   #李宗祐 陳正和(上期flag86) 張儀楦 皆在上期基準日之前就離職
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 張儀楦 李宗祐 陳正和（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "070319", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：111人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：113；差異百分比1.8%" & check02$organization_id == "070319", "", check02$flag95)
# 
# #國立彰師附工(070401)
#   #劉忠樸 蔡佳勳 許建斌 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：劉忠樸 蔡佳勳 許建斌（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "070401", "", check02$flag86)
#   #吳滄欽(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 吳滄欽（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "070401", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：179人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：182；差異百分比1.6%" & check02$organization_id == "070401", "", check02$flag95)
# 
# #國立永靖高工(070402)
#   #黃志隆 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：黃志隆（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "070402", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：105人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：105；差異百分比0.0%" & check02$organization_id == "070402", "", check02$flag95)
#   #國立彰化師範大學	教育學院學校行政研究所 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：邱子耀（碩士學位畢業系所（一）：教育學院學校行政研究所）" & check02$organization_id == "070402", "", check02$spe6)
# 
# #國立二林工商(070403)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：135人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：120；差異百分比-12.5%" & check02$organization_id == "070403", "", check02$flag95)
# 
# #國立秀水高工(070405)
#   #劉習酉 康美裕 梁艷絹 羅振遠 許永佳 許順傑 郭坤洲 黃麗娟 黃麗芳 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：劉習酉 康美裕 梁艷絹 羅振遠 許永佳 許順傑 郭坤洲 黃麗娟 黃麗芳（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "070405", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：130人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：130；差異百分比0.0%" & check02$organization_id == "070405", "", check02$flag95)
# 
# #國立彰化高商(070406)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：153人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：155；差異百分比1.3%" & check02$organization_id == "070406", "", check02$flag95)
#  
# #國立員林農工(070408)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：129人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：132；差異百分比2.3%" & check02$organization_id == "070408", "", check02$flag95)
#   #王如亮 同等學力，李貞（學士學位畢業學校（一）：弗羅里達州立農工大學） 正確
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：李貞（學士學位畢業學校（一）：弗羅里達州立農工大學） 王如亮（副學士或專科畢業學校（一）：同等學力）" & check02$organization_id == "070408", "", check02$spe6)
# 
# #國立員林崇實高工(070409)
#   #王麗粧約15歲開始工作無誤
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，職員(工)資料表：王麗粧57歲，但學校工作總年資有42年（約15歲開始工作）" & check02$organization_id == "070409", "", check02$flag39)
#   #吳貽誠 林麗珠 張志卿 張德煒 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "070409", "", check02$flag86)
#   #朱惠芬(上期flag86) 皆在上期基準日之前就離職
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 朱惠芬（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "070409", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：102人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：101；差異百分比-1.0%" & check02$organization_id == "070409", "", check02$flag95)
# 
# #國立員林家商(070410)
#   #張佳銘 陳奕蒨 曾豪偉 劉宏偉 皆非本學期退休或因故離職人員(3/18退休)
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "070410", "", check02$flag86)
#   #張瑜柔 陳姝璇(上期flag86) 皆在上期基準日之前就離職
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 張瑜柔 陳姝璇（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "070410", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：109人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：105；差異百分比-3.8%" & check02$organization_id == "070410", "", check02$flag95)
# 
# #國立北斗家商(070415)
#   #人事室主管 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "070415", "", check02$flag1)
#   #林宸羽 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "070415", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：121人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：117；差異百分比-3.4%" & check02$organization_id == "070415", "", check02$flag95)
# 
# #縣立彰化藝術高中(074308)
#   #職員(工)資料表：賈慶貞59歲，但學校工作總年資有43年（約16歲開始工作）這是正確的
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，職員(工)資料表：賈慶貞59歲，但學校工作總年資有43年（約16歲開始工作）" & check02$organization_id == "074308", "", check02$flag39)
#   #呂子欣 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "074308", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：120人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：122；差異百分比1.6%" & check02$organization_id == "074308", "", check02$flag95)
#   #聘任訖日確實為專任代理教師簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "074308", "", check02$flag102)
# 
# #縣立二林高中(074313)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：113人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：116；差異百分比2.6%" & check02$organization_id == "074313", "", check02$flag95)
# 
# #縣立和美高中(074323)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：139人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：140；差異百分比0.7%" & check02$organization_id == "074323", "", check02$flag95)
#   #國立彰化師範大學	教育研究所學校行政碩士班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：常方舜（碩士學位畢業系所（一）：教育研究所學校行政碩士班）" & check02$organization_id == "074323", "", check02$spe6)
# 
# #縣立田中高中(074328)
#   #長期代課教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "074328", "", check02$flag80)
#   #張佩香 蔡環宇 邱在君 郭慧敏 黃詩維 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：張佩香 蔡環宇 邱在君 郭慧敏 黃詩維（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "074328", "", check02$flag86)
#   #周經芝 李昆奮 林志青 鄧冠明 鄭如琬(上期flag86) 皆在上期基準日之前就離職
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 周經芝 李昆奮 林志青 鄧冠明 鄭如琬（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "074328", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：96人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：98；差異百分比2.0%" & check02$organization_id == "074328", "", check02$flag95)
#   #代理教師兼任學務主任 該校已報縣府教育局核准
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：陳彥成（代理(連) 學生事務處學務主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "074328", "", check02$flag96)
#   #國立彰化師範大學	教育研究所學校行政所 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：李秀麗（碩士學位畢業系所（一）：教育研究所學校行政所）" & check02$organization_id == "074328", "", check02$spe6)
# 
# #縣立成功高中(074339)
#   #人事室主管 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "074339", "", check02$flag1)
#   #阮瑛修（自然） 國中部教師 正確
# check02$flag45 <- if_else(check02$flag45 != "" & check02$organization_id == "074339", "", check02$flag45)
#   #尤伶美 吳玉聆 吳育倫 李惠雯 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "074339", "", check02$flag86)
#   #王俊興 周東平 洪崇恆 皆在上期基準日後到職(上期離退表漏填)
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "074339", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：105人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：104；差異百分比-1.0%" & check02$organization_id == "074339", "", check02$flag95)
# 
# #國立南投高中(080302)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：123人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：131；差異百分比6.1%" & check02$organization_id == "080302", "", check02$flag95)
# 
# #國立中興高中(080305)
#   #職員(工)資料表：李美紅60歲，但學校工作總年資有43年（約17歲開始工作） 這是正確的
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，職員(工)資料表：李美紅60歲，但學校工作總年資有43年（約17歲開始工作）" & check02$organization_id == "080305", "", check02$flag39)
#   #張依萍 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "080305", "", check02$flag86)
#   #王金對 呂清森 宋靄宜 李富慎 皆在上期基準日後到職
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "080305", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：98人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：97；差異百分比-1.0%" & check02$organization_id == "080305", "", check02$flag95)
#   #國立臺灣師範大學	教育研究所學校行政碩士班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：簡茆汯（碩士學位畢業系所（一）：教育研究所學校行政碩士班）" & check02$organization_id == "080305", "", check02$spe6)
# 
# #國立竹山高中(080307)
#   #劉孟蓁 劉惟中 方明通 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：劉孟蓁 劉惟中 方明通（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "080307", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：109人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：106；差異百分比-2.8%" & check02$organization_id == "080307", "", check02$flag95)
#   #資訊管理科副學士(二專) 正確
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：簡尚華（副學士或專科畢業科系（一）：資訊管理科副學士(二專)）" & check02$organization_id == "080307", "", check02$spe6)
# 
# #國立暨大附中(080308)
#   #劉修完 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "080308", "", check02$flag86)
#   #黃建翰(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 黃建翰（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "080308", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：91人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：94；差異百分比3.2%" & check02$organization_id == "080308", "", check02$flag95)
# 
# #國立仁愛高農(080401)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：51人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：52；差異百分比1.9%" & check02$organization_id == "080401", "", check02$flag95)
# 
# #國立埔里高工(080403)
#   #人事室主管 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "080403", "", check02$flag1)
#   #全秀珠 吳政穎 徐明輝 張文威 莊承誼 潘葳 賴怡翎 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "080403", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：103人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：100；差異百分比-3.0%" & check02$organization_id == "080403", "", check02$flag95)
#  
# #國立南投高商(080404)
#   #曾惠鈴 林忠勇 林盈伶 樂靜海 邱家君 鄒正如 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：曾惠鈴 林忠勇 林盈伶 樂靜海 邱家君 鄒正如（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "080404", "", check02$flag86)
#   #賴英哲(上期flag86) 皆在上期基準日之前就離職
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 賴英哲（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "080404", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：88人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：89；差異百分比1.1%" & check02$organization_id == "080404", "", check02$flag95)
# 
# #國立草屯商工(080406)
#   #洪芳芷 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "080406", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：132人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：132；差異百分比0.0%" & check02$organization_id == "080406", "", check02$flag95)
#   #鄭玄倫（碩士學位畢業系所（一）：教育研究所學校行政碩士班），蕭思文（副學士或專科畢業學校（一）：國立臺中商業專科學校附設高商補校） 學校表示無誤
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：鄭玄倫（碩士學位畢業系所（一）：教育研究所學校行政碩士班）； 職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：蕭思文（副學士或專科畢業學校（一）：國立臺中商業專科學校附設高商補校）" & check02$organization_id == "080406", "", check02$spe6)
# 
# #國立水里商工(080410)
#   #吳綺慧 莊雅蘭 連容里 黃雲 謝憲忠 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "080410", "", check02$flag86)
#   #伍純佑 皆在上期基準日之前就離職
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "080410", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：89人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：92；差異百分比3.3%" & check02$organization_id == "080410", "", check02$flag95)
# 
# #縣立旭光高中(084309)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：144人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：142；差異百分比-1.4%" & check02$organization_id == "084309", "", check02$flag95)
#   #國立彰化師範大學	教育研究所學校行政碩士 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：劉宗明（碩士學位畢業系所（一）：教育研究所學校行政碩士）" & check02$organization_id == "084309", "", check02$spe6)
# 
# #私立同濟高中(101303)
#   #無教務處主管 學務處主管 總務處主管 輔導室主管，主（會）計室主管屬於中學部
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：教務處主管 學務處主管 總務處主管 輔導室主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "101303", "", check02$flag1)
#   #洪世嘉 確實為該校離退教職員工
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 洪世嘉（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "101303", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：6人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：5；差異百分比-20.0%" & check02$organization_id == "101303", "", check02$flag95)
# 
# #私立協同高中(101304)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "101304", "", check02$flag80)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：97人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：94；差異百分比-3.2%" & check02$organization_id == "101304", "", check02$flag95)
#   #聘任訖日確實為專任代理教師簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "101304", "", check02$flag102)
# 
# #私立萬能工商(101406)
#   #林怡安（服務單位：實習處海外招生處 職務名稱：組長）實習處海外招生處 正確，主管為組長 正確
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "101406", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：40人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：38；差異百分比-5.3%" & check02$organization_id == "101406", "", check02$flag95)
#   #聘任訖日確實為校長簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 == "教員資料表：許瑞益（1150731）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "101406", "", check02$flag102)
# 
# #私立光禾華德福實驗學校(121302)
#   #確實沒有圖書館主管，有教務處主管 學務處主管 總務處主管 輔導室主管 人事室主管 主（會）計室主管，但各處室分別僅一人管理，職稱不是主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：教務處主管 學務處主管 總務處主管 輔導室主管 圖書館主管 人事室主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "121302", "", check02$flag1)
#   #葉友竹（兼任行政職服務單位(一)：國高中部） 職員(工)資料表之行政職資料不完整或不正確：姜宜辰（服務單位：教務室） 潘韻如（服務單位：學務室） 正確
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "121302", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：14人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：9；差異百分比-55.6%" & check02$organization_id == "121302", "", check02$flag95)
# 
# #財團法人新光高中(121306)
#   #確實沒有圖書館主管，總務處主管 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：總務處主管 圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "121306", "", check02$flag1)
#   #沒有設置科主任或學程主任
# check02$flag2 <- if_else(check02$flag2 == "請學校確認是否設置科主任或學程主任" & check02$organization_id == "121306", "", check02$flag2)
#   #廖霈清 林姸妙 確實為該校離退教職員工
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 廖霈清 林姸妙（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "121306", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：5人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：12；差異百分比58.3%" & check02$organization_id == "121306", "", check02$flag95)
# 
# #財團法人普門中學(121307)
#   #確實沒有實習處主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：實習處主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "121307", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "121307", "", check02$flag18)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "121307", "", check02$flag80)
#   #何鳳珍 林國金 陳勇宏 馬日寶 魏韶寬 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：何鳳珍 林國金 陳勇宏 馬日寶 魏韶寬（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "121307", "", check02$flag86)
#   #莊惠雯(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 莊惠雯（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "121307", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：51人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：48；差異百分比-6.2%" & check02$organization_id == "121307", "", check02$flag95)
#   #約聘僱可算全職，可暫不請學校修正
# check02$flag96 <- if_else(check02$flag96 == "職員(工)資料表：蔡承璋（約聘僱 總務處主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "121307", "", check02$flag96)
# 
# #私立正義高中(121318)
#   #確實沒有圖書館主管，實際上於教務處會有人去管理圖書館
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "121318", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "121318", "", check02$flag18)
#   #校長7/31退休，8/1再任
# check02$flag83 <- if_else(check02$flag83 == "教員資料表：俞德淦（請確認上述人員是否退休、退伍或因故離職，若是，則不需填列至本次教員資料表或職員（工）資料表，並請依欄位說明確認離退職類別）" & check02$organization_id == "121318", "", check02$flag83)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：26人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：27；差異百分比3.7%" & check02$organization_id == "121318", "", check02$flag95)
#   #約聘僱可算全職，可暫不請學校修正
# check02$flag96 <- if_else(check02$flag96 == "職員(工)資料表：呂時傑（約聘僱 總務處主任）（約聘僱 學務處主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "121318", "", check02$flag96)
# 
# #私立義大國際高中(121320)
#   #輔導室主任 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：輔導室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "121320", "", check02$flag1)
#   #學務處設有主任 副主任
# check02$flag18 <- if_else(check02$flag18 == "學務處主管（主任）人數超過一位，請再協助確認實際聘任情況。" & check02$organization_id == "121320", "", check02$flag18)
#   #人事室、校長室的主管為組長，職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "121320", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：32人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：34；差異百分比5.9%" & check02$organization_id == "121320", "", check02$flag95)
# # #  #柯瓊琪（碩士學位畢業學校（一）：VNIVERSITAS PENNSYLVANIENSIS）正確
# # # check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：柯瓊琪（碩士學位畢業學校（一）：VNIVERSITASPENNSYLVANIENSIS）" & check02$organization_id == "121320", "", check02$spe6)
# 
# #私立中山工商(121405)
#   #李昱平（兼任行政職職稱(一)：專輔）（校長同時為專職輔導老師）
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "121405", "", check02$flag62)
#   #卜英凡 林子晴 梁孟群 陳文鎮 黃信淵 董韋伯 蘇建中 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "121405", "", check02$flag86)
#   #林家彣 皆在上期基準日之前就離職
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "121405", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：301人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：289；差異百分比-4.2%" & check02$organization_id == "121405", "", check02$flag95)
#   #代理可算全職，可暫不請學校修正
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：鄧一帆（代理(連) 學務處學務處主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "121405", "", check02$flag96)
# 
# #私立旗美商工(121410)
#   #確實沒有設置學務處主管 輔導室主管，圖書館主任隸屬於教務處
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：學務處主管 輔導室主管 圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "121410", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低、教員資料表專任教學人員人數偏低、教員資料表主聘單位各類別人數分布異常
# check02$flag18 <- if_else(check02$flag18 == "教員資料表主聘單位各類別人數分布異常，請再協助確認實際聘任情況。；職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "121410", "", check02$flag18)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：3人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：5；差異百分比40.0%" & check02$organization_id == "121410", "", check02$flag95)
#   #約聘僱可算全職，可暫不請學校修正
# check02$flag96 <- if_else(check02$flag96 == "職員(工)資料表：尹素月（約聘僱 會計室會計主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "121410", "", check02$flag96)
#   #林春貴 國立屏東大學	教育行政
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：林春貴（博士學位畢業系所（一）：教育行政）" & check02$organization_id == "121410", "", check02$spe6)
# 
# #私立高英工商(121413)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：60人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：52；差異百分比-15.4%" & check02$organization_id == "121413", "", check02$flag95)
# 
# #私立華德工家(121415)
#   #有填 教務處圖書室主任
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "121415", "", check02$flag1)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：22人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：20；差異百分比-10.0%" & check02$organization_id == "121415", "", check02$flag95)
# 
# #私立高苑工商(121417)
#   #確實沒有圖書館主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "121417", "", check02$flag1)
#   #放過學校 教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。一年以上與任教領域相關之業界實務工作經驗人數偏多。
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。一年以上與任教領域相關之業界實務工作經驗人數偏多（請再協助確認，『是否具備一年以上與任教領域相關之業界實務工作經驗』填寫『Y』之教員，是否確依欄位說明具備此經驗）" & check02$organization_id == "121417", "", check02$flag18)
#   #專任教師陸美麗，112/08/01離職後，1131又回來擔任代理教師
# check02$flag83 <- if_else(check02$flag83 == "教員資料表：陸美麗（請確認上述人員是否退休、退伍或因故離職，若是，則不需填列至本次教員資料表或職員（工）資料表，並請依欄位說明確認離退職類別）" & check02$organization_id == "121417", "", check02$flag83)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：57人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：67；差異百分比14.9%" & check02$organization_id == "121417", "", check02$flag95)
#   #科主任不算一級主管 陳建宏（代理(連) 電機科主任） 陳慕寧（代理(連) 餐飲管理科主任）
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：陳建宏（代理(連) 電機科主任） 陳慕寧（代理(連) 餐飲管理科主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "121417", "", check02$flag96)
# 
# #國立臺東大學附屬體育高中(140301)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：57人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：57；差異百分比0.0%" & check02$organization_id == "140301", "", check02$flag95)
#   #聘任訖日確實為專任代理教師簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "140301", "", check02$flag102)
# 
# #國立臺東女中(140302)
#   #朱文鳳 吳誠正 張潔宜 萬慧聖 蔡舜宇 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "140302", "", check02$flag86)
#   #林淑慧(上期flag86) 皆在上期基準日之前就離職
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "140302", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：72人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：73；差異百分比1.4%" & check02$organization_id == "140302", "", check02$flag95)
# 
# #國立臺東高中(140303)
#   #人事室主管 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "140303", "", check02$flag1)
#   #王淑青 胡家菱 倪偵傑 張麗鎰 蔡緗琳 簡禎玲 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "140303", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：80人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：78；差異百分比-2.6%" & check02$organization_id == "140303", "", check02$flag95)
# 
# #國立關山工商(140404)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：55人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：54；差異百分比-1.9%" & check02$organization_id == "140404", "", check02$flag95)
# 
# #國立臺東高商(140405)
#   #李卿文 王碧如 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：李卿文 王碧如（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "140405", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：91人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：94；差異百分比3.2%" & check02$organization_id == "140405", "", check02$flag95)
# 
# #國立成功商水(140408)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：35人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：36；差異百分比2.8%" & check02$organization_id == "140408", "", check02$flag95)
#  
# #臺東縣均一高中(141301)
#   #確實沒有設置圖書館主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "141301", "", check02$flag1)
#   #放過學校 教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "141301", "", check02$flag18)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：22人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：31；差異百分比29.0%" & check02$organization_id == "141301", "", check02$flag95)
#   #白珮璇（代理(連) 國際部主任） 舒兆瑞（代理(連) 學務處主任）
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：白珮璇（代理(連) 國際部主任） 舒兆瑞（代理(連) 學務處主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "141301", "", check02$flag96)
#   #聘任訖日確實為專任代理教師簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "141301", "", check02$flag102)
# 
# #私立育仁高中(141307)
#   #確實沒有設置輔導室主管(網站有 已去電確認確實沒有) 圖書館主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：輔導室主管 圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "141307", "", check02$flag1)
# # #  #放過學校 教員資料表專任人員人數偏低
# # # check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "141307", "", check02$flag18)
# # #  #兼任教師連續聘任不中斷無誤
# # # check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "141307", "", check02$flag80)
#   #洪義成 黃心妤 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：洪義成 黃心妤（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "141307", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：12人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：11；差異百分比-9.1%" & check02$organization_id == "141307", "", check02$flag95)
#   #王家祺（代理(連) 總務處總務主任）
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：王家祺（代理(連) 總務處總務主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "141307", "", check02$flag96)
# 
# #私立公東高工(141406)
#   #確實沒有設置圖書館主管 僅有組長(屬於教務處)
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "141406", "", check02$flag1)
#   #輔導室主任、實習輔導處主任
# check02$flag18 <- if_else(check02$flag18 == "輔導室主管（主任）人數超過一位，請再協助確認實際聘任情況。" & check02$organization_id == "141406", "", check02$flag18)
#   #職務名稱：修女 職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "141406", "", check02$flag62)
#   #許裕明 鄭順福 陳羿璇 應為代理教師，上期資料填錯
# check02$flag86 <- if_else(check02$flag86 == "姓名：許裕明 鄭順福 陳羿璇（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "141406", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：43人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：35；差異百分比-22.9%" & check02$organization_id == "141406", "", check02$flag95)
#   #曾趙立中（代理 總務處主任）
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：曾趙立中（代理(連) 總務處主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "141406", "", check02$flag96)
#   #聘任訖日確實為專任代理教師簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "141406", "", check02$flag102)
# 
# #縣立蘭嶼高中(144322)
#   #確實沒有圖書館主管，人事室主管暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "144322", "", check02$flag1)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：33人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：30；差異百分比-10.0%" & check02$organization_id == "144322", "", check02$flag95)
#   #聘任訖日確實為專任代理教師簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "144322", "", check02$flag102)
# 
# #國立基隆女中(170301)
#   #公傷假 正確
# check02$flag16 <- if_else(check02$flag16 == "教員資料表需修改請假類別：王智弘（公傷假）（請依規定確認或修正請假類別，或是否屬於請假，若以上人員未有請假情事，請填寫半型大寫『N』）" & check02$organization_id == "170301", "", check02$flag16)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：111人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：111；差異百分比0.0%" & check02$organization_id == "170301", "", check02$flag95)
#   #聘任迄日皆正確
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "170301", "", check02$flag102)
# 
# #國立基隆高中(170302)
#   #教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。教師人數偏低，請再協助確認實際聘任情況。" & check02$organization_id == "170302", "", check02$flag18)
# #   #毛淑娟 江木發 鄭義翰(上期flag86)
# # check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "170302", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：84人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：83；差異百分比-1.2%" & check02$organization_id == "170302", "", check02$flag95)
#   #古拉斯．達那哈 呂悦慈 斐立安法蕾萳 正確
# check02$flag98 <- if_else(check02$flag98 == "教員資料表：請確認該員基本資料：古拉斯．達那哈（姓名） 呂悦慈（姓名） 斐立安法蕾萳（姓名）" & check02$organization_id == "170302", "", check02$flag98)
# #   #國立臺北工專（國立臺北科技大學） 正確
# # check02$spe5 <- if_else(check02$spe5 == "教員資料表：李文廣（副學士學位畢業學校（一）：國立臺北工專（國立臺北科技大學））（請務必確認以上人員畢業證書所載學位別。若副學士或專科畢業學校為(科技/空中)大學、(技術)學院或其他技職校院，且確認為專科學制，請於「副學士或專科畢業學校」欄位中在校名後註記專科學制或專科部）" & check02$organization_id == "170302", "", check02$spe5)
# #   #CONSERVATORY REGIONAL INFLUENCE 正確
# # check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：李泰和（碩士學位畢業學校（一）：CONSERVATORYREGIONALINFLUENCE）" & check02$organization_id == "170302", "", check02$spe6)
# 
# #國立基隆商工(170404)
#   #林紋梅(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 林紋梅（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "170404", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：148人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：150；差異百分比1.3%" & check02$organization_id == "170404", "", check02$flag95)
#   #國立政治大學	教育學院學校行政碩士在職專班、美國德州農工大學 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：江巨材（碩士學位畢業系所（一）：教育學院學校行政碩士在職專班） 謝靜雅（碩士學位畢業學校（一）：美國德州農工大學）" & check02$organization_id == "170404", "", check02$spe6)
# 
# #市立中山高中(173304)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：77人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：78；差異百分比1.3%" & check02$organization_id == "173304", "", check02$flag95)
# 
# #市立安樂高中(173306)
#   #張妙妃 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "173306", "", check02$flag86)
#   #石清杉(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 石清杉（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "173306", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：88人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：90；差異百分比2.2%" & check02$organization_id == "173306", "", check02$flag95)
# 
# #市立暖暖高中(173307)
#   #闕淑煜61歲，但學校工作總年資有46年（約15歲開始工作） 正確
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，職員(工)資料表：闕淑煜61歲，但學校工作總年資有46年（約15歲開始工作）" & check02$organization_id == "173307", "", check02$flag39)
#   #蔡佩珊 邱詩婷 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：蔡佩珊 邱詩婷（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "173307", "", check02$flag86)
#   #徐櫻瑞(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 徐櫻瑞（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "173307", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：67人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：64；差異百分比-4.7%" & check02$organization_id == "173307", "", check02$flag95)
# 
# #市立八斗高中(173314)
#   #梁上棟 郭俶妗 蔡佩君 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "173314", "", check02$flag86)
#   #孫佳穗 李昭儀 應為本期離退，上期也填在離退表為誤植
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 孫佳穗 李昭儀（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "173314", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：64人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：68；差異百分比5.9%" & check02$organization_id == "173314", "", check02$flag95)
# 
# #國立海洋大學附屬基隆海事(170403)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "170403", "", check02$flag18)
#   #鄭淑蕙(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 鄭淑蕙（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "170403", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：122人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：121；差異百分比-0.8%" & check02$organization_id == "170403", "", check02$flag95)
#   #職員(工)資料表：徐淑珍（1140831） 聘任迄日正確
# check02$flag102 <- if_else(check02$flag102 == "職員(工)資料表：徐淑珍（1140831）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "170403", "", check02$flag102)
# 
# #私立光復高中(181305)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "181305", "", check02$flag18)
#   #陳麗娟49歲，但學校工作總年資有32年（約17歲開始工作） 無誤
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，職員(工)資料表：陳麗娟49歲，但學校工作總年資有32年（約17歲開始工作）" & check02$organization_id == "181305", "", check02$flag39)
#   #吳宜蓁 廖雪鈺 楊金銘 洪敏勝 王漢霖 藍伯彊 陳志明 黃太華 皆非本學期退休或因故離職人員
#     #1121職員(工)資料表有兩位邱昀昀，身分證A22開頭這筆是不小心多填的，這筆應刪除，故1131資料，flag86抓到這筆未填在離退表。
# check02$flag86 <- if_else(check02$flag86 == "姓名：吳宜蓁 廖雪鈺 楊金銘 洪敏勝 王漢霖 藍伯彊 邱昀昀 陳志明 黃太華（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "181305", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：173人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：162；差異百分比-6.8%" & check02$organization_id == "181305", "", check02$flag95)
#   #聘任迄日皆正確
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "181305", "", check02$flag102)
#   #謝馥霞（碩士學位畢業學校（一）：NEW ENGLAND CONSERVATORY OF MUSIC）正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：謝馥霞（碩士學位畢業學校（一）：NEWENGLANDCONSERVATORYOFMUSIC）" & check02$organization_id == "181305", "", check02$spe6)
# 
# #私立曙光女中(181306)
#   #確實沒有設置圖書館主管 實習處主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 實習處主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "181306", "", check02$flag1)
#   #沒有設置科主任
# check02$flag2 <- if_else(check02$flag2 == "請學校確認是否設置科主任或學程主任" & check02$organization_id == "181306", "", check02$flag2)
#   #高中部教務主任、國中部教務主任
# check02$flag18 <- if_else(check02$flag18 == "教務處主管（主任）人數超過一位，請再協助確認實際聘任情況。" & check02$organization_id == "181306", "", check02$flag18)
#   #詹勳國/詹勲國
# check02$flag91 <- if_else(check02$flag91 == "請確認：詹勳國/詹勲國（離退人員於上一期資料填報姓名與本次資料不相同。請務必確認修正，如已更名，請來電告知。）" & check02$organization_id == "181306", "", check02$flag91)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：100人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：94；差異百分比-6.4%" & check02$organization_id == "181306", "", check02$flag95)
#   #聘任迄日皆正確
# check02$flag102 <- if_else(check02$flag102 == "教員資料表：何秀鑾（1150731） 余佩倫（1150731） 侯志昌（1150731） 吳伶玫（1150731） 吳俊翰（1150731） 吳縉雯（1150731） 呂淑鈴（1150731） 周明麗（1150731） 周雅瑜（1150731） 姚惠麗（1150731） 孫韡旂（1150731） 張俊清（1150731） 張心瑀（1150731） 張育儒（1150731） 張鈞豪（1150731） 張雅雯（1150731） 徐芝玲（1150731） 戴伊瑋（1150731） 曾詩蘋（1150731） 李明諮（1150731） 李欣樺（1150731） 李芷宣（1150731） 林于鈞（1150731） 林宏明（1150731） 林欣儒（1150731） 林育靖（1150731） 林雅倩（1150731） 林靜儀（1150731） 楊健一（1150731） 楊昆峯（1150731） 楊雅芳（1150731） 洪韻雯（1150731） 游雅婷（1150731） 王視沛（1150731） 王美玲（1150731） 白育甄（1150731） 羅丹廷（1150731） 葉智文（1150731） 葉瑋庭（1150731） 葉維韻（1150731） 蔡佩吟（1150731） 蔡嘉訓（1150731） 蔡嘉鳳（1150731） 蔡婕妤（1150731） 蔡欣蒨（1150731） 蔡沛諺（1150731） 蔡淳意（1150731） 蔡玉琳（1150731） 蕭帆（1150731） 蕭芷芸（1150731） 薛伊君（1150731） 藍仁杰（1150731） 蘇曉霓（1150731） 許采甄（1150731） 許雁綺（1150731） 詹世軒（1150731） 詹心瑜（1150731） 邱書怡（1150731） 邵子颺（1150731） 郭雅億（1150731） 鄭玉連（1150731） 陳仙怡（1150731） 陳宛玉（1150731） 陳彥宇（1150731） 陳念雯（1150731） 陳淑婉（1150731） 陳淑珍（1150731） 陳筱琪（1150731） 陳筱蕙（1150731） 陳錦慧（1150731） 馬涵巧（1150731） 駱美璇（1150731） 麥馨月（1150731） 黃丹琪（1150731） 黃婷萱（1150731） 黃彥智（1150731） 黃惠涓（1150731） 黃慧音（1150731） 黃銘信（1150731） 黃麗燕（1150731）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "181306", "", check02$flag102)
#   #魯和鳳，國立政治大學 教育學院學校行政
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：魯和鳳（碩士學位畢業系所（一）：教育學院學校行政）" & check02$organization_id == "181306", "", check02$spe6)
# 
# #私立磐石高中(181307)
#   #確實沒有設置圖書館主管 主（會）計室主管暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "181307", "", check02$flag1)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：102人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：97；差異百分比-5.2%" & check02$organization_id == "181307", "", check02$flag95)
# 
# #私立世界高中(181308)
#   #確實沒有輔導室主管 實習處主管(有實習處(實輔處)) 圖書館主任(教務處有人會管理，實際上沒有相關職稱)
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：輔導室主管 圖書館主管 實習處主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "181308", "", check02$flag1)
#   #放過學校 教員資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "181308", "", check02$flag18)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "181308", "", check02$flag80)
#   #李芃 謝曉芬 辛筱媛 確實為上期離退教職員工
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 李芃 謝曉芬 辛筱媛（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "181308", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：19人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：16；差異百分比-18.8%" & check02$organization_id == "181308", "", check02$flag95)
# 
# # #國立嘉義女中(200302)
# #   #本項目不需請學校修正
# # check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：122人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：122；差異百分比0.0%" & check02$organization_id == "200302", "", check02$flag95)
# # 
# # #國立嘉義高中(200303)
# #   #本項目不需請學校修正
# # check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：156人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：158；差異百分比1.3%" & check02$organization_id == "200303", "", check02$flag95)
# #   #職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：李家芃（碩士學位畢業學校（一）：L'INSTITUTDESHAUTESETUDESECONOMIQUESETCOMMERCIALES） 正確
# # check02$spe6 <- if_else(check02$spe6 != "" & check02$organization_id == "200303", "", check02$spe6)
# # 
# # #國立華南高商(200401)
# #   #張梅漪 李仁傑 皆非本學期退休或因故離職人員(2/1)
# # check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "200401", "", check02$flag86)
# #   #劉芝妤 吳宛倫 葉明昌 黃勝騰 皆在上期基準日之前就離職(8/1)
# # check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "200401", "", check02$flag93)
# #   #本項目不需請學校修正
# # check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：109人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：107；差異百分比-1.9%" & check02$organization_id == "200401", "", check02$flag95)
# # 
# # #國立嘉義高工(200405)
# #   #林祐詩 非專任人員(計畫人員，應屬約用或約聘僱) 、賴建良 (教官，2/1調職) 皆非本學期退休或因故離職人員
# # check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "200405", "", check02$flag86)
# #   #吳美凰 徐聯昌 林春玫 沈彥輝 王書清 黃玉恩 皆在上期基準日之前就離職(8/1~9/30)
# # check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "200405", "", check02$flag93)
# #   #本項目不需請學校修正
# # check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：225人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：229；差異百分比1.7%" & check02$organization_id == "200405", "", check02$flag95)
# # 
# # #國立嘉義高商(200406)
# #   #呂振華 黃博軒 皆非本學期退休或因故離職人員(2/1)
# # check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "200406", "", check02$flag86)
# #   #黃綉婷 皆在上期基準日之前就離職(8/1)
# # check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "200406", "", check02$flag93)
# #   #本項目不需請學校修正
# # check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：111人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：113；差異百分比1.8%" & check02$organization_id == "200406", "", check02$flag95)
# # 
# # #國立嘉義家職(200407)
# #   #本項目不需請學校修正
# # check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：102人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：103；差異百分比1.0%" & check02$organization_id == "200407", "", check02$flag95)
# 
# #私立興華高中(201304)
#   #總務處有總務主任、會計主任
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "201304", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低、總務處有總務主任、會計主任
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。總務處主管（主任）人數超過一位，請再協助確認實際聘任情況。" & check02$organization_id == "201304", "", check02$flag18)
#   #蔡淑真/蔡幸珏 更名
# check02$flag91 <- if_else(check02$flag91 == "請確認：蔡淑真/蔡幸珏（離退人員於上一期資料填報姓名與本次資料不相同。請務必確認修正，如已更名，請來電告知。）" & check02$organization_id == "201304", "", check02$flag91)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：44人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：35；差異百分比-25.7%" & check02$organization_id == "201304", "", check02$flag95)
#   #科主任不屬於一級主管、約聘僱算全職 給通過
# check02$flag96 <- if_else(check02$flag96 == "職員(工)資料表：江政達（約聘僱 總務處總務主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "201304", "", check02$flag96)
# 
# #私立仁義高中(201309)
#   #確實沒有設置學務處主管 輔導室主管 圖書館主管 實習處主管 人事室主管 主（會）計室主管，校長為教務主任代理，並兼任總務主任，並分別設有一位人事、會計
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：學務處主管 輔導室主管 圖書館主管 實習處主管 人事室主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "201309", "", check02$flag1)
#   #藍聖博 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：藍聖博（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "201309", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：2人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：1；差異百分比-100.0%" & check02$organization_id == "201309", "", check02$flag95)
# 
# #私立嘉華高中(201310)
#   #放過學校 職員(工)資料表專任人員人數偏低、教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "201310", "", check02$flag18)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：44人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：44；差異百分比0.0%" & check02$organization_id == "201310", "", check02$flag95)
#   #代理可算全職，可暫不請學校修正
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：高禎雅（代理(連) 輔導室主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "201310", "", check02$flag96)
# 
# #私立輔仁高中(201312)
#   #確實沒有圖書館主管 實習處主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 實習處主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "201312", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "201312", "", check02$flag18)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：62人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：62；差異百分比0.0%" & check02$organization_id == "201312", "", check02$flag95)
#   #約聘僱可算全職，可暫不請學校修正
# check02$flag96 <- if_else(check02$flag96 == "職員(工)資料表：陳旺（約聘僱 校長室主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "201312", "", check02$flag96)
#   #教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：馬政剛（學士學位畢業學校國別（一）：學士班肄業；學士學位畢業學校（一）：學士班肄業；學士學位畢業科系（一）：學士班肄業） 該員依其他相關規定，於專科與學士班皆未畢業之前提下，修讀並取得碩士學位 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：馬政剛（學士學位畢業學校國別（一）：學士班肄業；學士學位畢業學校（一）：學士班肄業；學士學位畢業科系（一）：學士班肄業）" & check02$organization_id == "201312", "", check02$spe6)
# 
# #私立宏仁女中(201313)
#   #確實沒有輔導室主管 圖書館主管 主（會）計室主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：輔導室主管 圖書館主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "201313", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "201313", "", check02$flag18)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：20人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：19；差異百分比-5.3%" & check02$organization_id == "201313", "", check02$flag95)
#   #教員資料表：許耀文（1160731） 校長聘任迄日正確
# check02$flag102 <- if_else(check02$flag102 == "教員資料表：許耀文（1160731）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "201313", "", check02$flag102)
# 
# #私立立仁高中(201314)
#   #確實沒有設置圖書館主管 人事室主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "201314", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "201314", "", check02$flag18)
#   #鐘點教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "201314", "", check02$flag80)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：8人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：6；差異百分比-33.3%" & check02$organization_id == "201314", "", check02$flag95)
# 
# #私立東吳工家(201408)
#   #確實沒有圖書館主管 僅設組長
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "201408", "", check02$flag1)
# # #  #職稱及服務單位無誤 實習處即測即評及發證中心確實有兩位組長
# # #     # 吳文賓（兼任行政職服務單位(二)：技藝學程中心(台南區)） 
# # #     # 張博良（兼任行政職服務單位(二)：技藝學程中心(嘉義縣)） 
# # #     # 陳明堂（兼任行政職服務單位(二)：技藝學程中心(嘉義市)；兼任行政職服務單位(一)：實習處即測即評及發證中心 兼任行政職職稱(一)：組長；兼任行政職服務單位(二)：技藝學程中心(嘉義市) 兼任行政職職稱(二)：組長） 
# # #     # 陳育修（兼任行政職職稱(一)：處長；兼任行政職服務單位(一)：僑生事務處；兼任行政職職稱(二)：僑務副校長）
# # #     # 張瓊惠（兼任行政職服務單位(一)：技藝學程中心 兼任行政職職稱(一)：組長） 
# # #     # 林正凰（兼任行政職服務單位(一)：圖書室 兼任行政職職稱(一)：組長） 
# # #     # 翁韻茹（兼任行政職服務單位(一)：實習處即測即評及發證中心 兼任行政職職稱(一)：組長） 
# # #     # 陳明堂（兼任行政職服務單位(二)：技藝學程中心(嘉義市)；兼任行政職服務單位(一)：實習處即測即評及發證中心 兼任行政職職稱(一)：組長；兼任行政職服務單位(二)：技藝學程中心(嘉義市) 兼任行政職職稱(二)：組長）
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "201408", "", check02$flag62)
#   #放過學校 教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "201408", "", check02$flag18)
#   #吳芳瑩（管樂） 王景濡（管樂） 東吳工家有管樂隊
# check02$flag45 <- if_else(check02$flag45 != "" & check02$organization_id == "201408", "", check02$flag45)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：90人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：83；差異百分比-8.4%" & check02$organization_id == "201408", "", check02$flag95)
#   #徐毓瑩（博士學位畢業系所（一）：大學院人間文化研究科；碩士學位畢業系所（一）：大學院言語文化研究科） 梶原宏之KAJIHARAHIROYUKI（碩士學位畢業學校（一）：國立筑波大学） 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：徐毓瑩（博士學位畢業系所（一）：大學院人間文化研究科；碩士學位畢業系所（一）：大學院言語文化研究科） 梶原宏之KAJIHARAHIROYUKI（碩士學位畢業學校（一）：國立筑波大学）" & check02$organization_id == "201408", "", check02$spe6)
# 
# #臺北市育達高中(311401)
#   #確實沒有實習處主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：實習處主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "311401", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低 教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。；教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "311401", "", check02$flag18)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：72人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：81；差異百分比11.1%" & check02$organization_id == "311401", "", check02$flag95)
#   #約聘僱可算全職，可暫不請學校修正 何奕萱（約聘僱 教育服務中心約聘教育服務中心主任） 洪毓俊（約聘僱 公關事務中心約聘校務主任兼公關事務主任） 楊睿淑（約聘僱 會計室約聘會計主任）
# check02$flag96 <- if_else(check02$flag96 == "職員(工)資料表：何奕萱（約聘僱 教育服務中心約聘教育服務中心主任） 楊睿淑（約聘僱 會計室約聘會計主任） 洪毓俊（約聘僱 公關事務中心約聘校務主任兼公關事務主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "311401", "", check02$flag96)
#   #聘任訖日確實為實際聘約日
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "311401", "", check02$flag102)
#   #王麗香（碩士學位畢業學校（一）：德州農工） 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：王麗香（碩士學位畢業學校（一）：德州農工）" & check02$organization_id == "311401", "", check02$spe6)
# 
# #市立西松高中(313301)
#   #確實沒有主（會）計室主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "313301", "", check02$flag1)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：114人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：112；差異百分比-1.8%" & check02$organization_id == "313301", "", check02$flag95)
# 
# #市立中崙高中(313302)
#   #教師劉凱玲，112/08/01以專任身分退休，112/09/30改聘兼任，故上期(1121)資料為兼任的教師，本期(1131)填列在離退表
# check02$flag84 <- if_else(check02$flag84 == "教員：劉凱玲（查貴校上一學年所填資料，上述人員聘任類別非屬『專任』。依欄位說明，非專任教職員(工)之退休或離職者，不須填列離退教職員(工)資料表，請務必再確認。）" & check02$organization_id == "313302", "", check02$flag84)
#   #劉晶晶 李鈞慈 林秀玲 蔣炳政 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：劉晶晶 李鈞慈 林秀玲 蔣炳政（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "313302", "", check02$flag86)
#   #吳惠倩 賴宜君 邱肇純 鍾淑秋 陳信奇( 皆在上期基準日之前就離職(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 吳惠倩 賴宜君 邱肇純 鍾淑秋 陳信奇（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "313302", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：137人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：142；差異百分比3.5%" & check02$organization_id == "313302", "", check02$flag95)
#   #國立彰化師範大學	教育研究所學校行政碩士班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：黃衣婕（碩士學位畢業系所（一）：教育研究所學校行政碩士班）" & check02$organization_id == "313302", "", check02$spe6)
# 
# #臺北市私立協和祐德高級中學(321399)
#   #確實沒有設置圖書館主管 實習處主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 實習處主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "321399", "", check02$flag1)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：21人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：19；差異百分比-10.5%" & check02$organization_id == "321399", "", check02$flag95)
# 
# #市立松山高中(323301)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：150人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：150；差異百分比0.0%" & check02$organization_id == "323301", "", check02$flag95)
#   #林昇茂 國立臺灣師範大學	教育學系(學校行政班)、陳宣融 美國密蘇里大學	教育、學校和諮商心理學系 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：林昇茂（碩士學位畢業系所（一）：教育學系(學校行政班)）； 職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：陳宣融（碩士學位畢業系所（一）：教育、學校和諮商心理學系）" & check02$organization_id == "323301", "", check02$spe6)
# 
# #市立永春高中(323302)
#   #主（會）計室主管 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "323302", "", check02$flag1)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "323302", "", check02$flag80)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：115人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：117；差異百分比1.7%" & check02$organization_id == "323302", "", check02$flag95)
#   #國立政治大學	學校行政碩士在職專班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：浦憶娟（碩士學位畢業系所（一）：學校行政碩士在職專班）" & check02$organization_id == "323302", "", check02$spe6)
# 
# #市立松山家商(323401)
#   #主（會）計室主管 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "323401", "", check02$flag1)
#   #李怜潔改名為李薾方
# check02$flag91 <- if_else(check02$flag91 == "請確認：李怜潔/李薾方（離退人員於上一期資料填報姓名與本次資料不相同。請務必確認修正，如已更名，請來電告知。）" & check02$organization_id == "323401", "", check02$flag91)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：164人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：160；差異百分比-2.5%" & check02$organization_id == "323401", "", check02$flag95)
#   #專任教師 廖姿涵 改名 廖品喬 沒有離退，仍然填在教員資料表，不會抓出，僅記錄
# 
# #國立師大附中(330301)
#   #羅鴻城（0250815）出生年月日無誤
# check02$flag7 <- if_else(check02$flag7 == "教員資料表：羅鴻城（0250815）（請確認出生年月日是否正確）" & check02$organization_id == "330301", "", check02$flag7)
#   #教員資料表：羅鴻城88歲，但學校工作總年資有0年（約88歲開始工作）這是正確的
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，教員資料表：羅鴻城88歲，但學校工作總年資有0年（約88歲開始工作）" & check02$organization_id == "330301", "", check02$flag39)
#   #王啟光 朱美卿 林秀娟 林義雄 陳麗文 黃藝美 潘素貞 魯秀華皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "330301", "", check02$flag86)
#   #宋寶麒 確實為該校教職員工
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 宋寶麒（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度第二學期（113年2月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "330301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：248人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：257；差異百分比3.5%" & check02$organization_id == "330301", "", check02$flag95)
#   #聘任訖日確實為實際聘約日
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "330301", "", check02$flag102)
#   #國立陽明大學	生命科學系暨基因體科學研究所 正確(陽明大學的畢業證書確實是這樣寫 授予學士學位)
#     #德國	國立福萊堡、德國	國立特洛辛根 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：廖少暘（學士學位畢業科系（一）：生命科學系暨基因體科學研究所） 王昱尹（碩士學位畢業學校（一）：國立福萊堡） 蔡佳憓（碩士學位畢業學校（一）：國立特洛辛根）" & check02$organization_id == "330301", "", check02$spe6)
# 
# #私立延平中學(331301)
#   #姚垂坤 張文斌 連芳國 陳正來 黃成領 黃育菁 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：姚垂坤 張文斌 連芳國 陳正來 黃成領 黃育菁（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "331301", "", check02$flag86)
#   #劉珍妮 張志強 張漢鏞 王和明 葉秀蓉 陳淑媛 陳鵬仁 馬根善 確實為該校教職員工
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 劉珍妮 張志強 張漢鏞 王和明 葉秀蓉 陳淑媛 陳鵬仁 馬根善（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "331301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：134人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：135；差異百分比0.7%" & check02$organization_id == "331301", "", check02$flag95)
# 
# #市立松山工農(323402)
#   #張炳森（0270315） 正確
# check02$flag7 <- if_else(check02$flag7 == "教員資料表：張炳森（0270315）（請確認出生年月日是否正確）" & check02$organization_id == "323402", "", check02$flag7)
#   #鐘點教師	聘任科別：本土語 這次可給通過
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，教員資料表：張炳森86歲，但學校工作總年資有0年（約86歲開始工作）" & check02$organization_id == "323402", "", check02$flag39)
#   #呂茹茜 張詠竣 施政文 李嘉昀 胡家群 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：呂茹茜 張詠竣 施政文 李嘉昀 胡家群（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "323402", "", check02$flag86)
#   #蕭芳玲 蘇俊旗(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 蕭芳玲 蘇俊旗（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "323402", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：190人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：192；差異百分比1.0%" & check02$organization_id == "323402", "", check02$flag95)
# 
# #私立金甌女中(331302)
#   #確實沒有設置圖書館主管 實習處主管 人事室主管 皆只有組長
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 實習處主管 人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "331302", "", check02$flag1)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "331302", "", check02$flag80)
#   #王緒文 鄭清陽 陳坤智 顧應鳳 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：王緒文 鄭清陽 陳坤智 顧應鳳（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "331302", "", check02$flag86)
#   #林慧穎 熊經中 劉怡秀 魏延華 羅運瑛(上期flag86)
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "331302", "", check02$flag93)
# #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：58人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：59；差異百分比1.7%" & check02$organization_id == "331302", "", check02$flag95)
# 
# #私立復興實驗高中(331304)
#   #江沛潔應聘當時的專長即為"特教" 負責該校所有特教業務 且聘書無註記身障或資優
# check02$flag45 <- if_else(check02$flag45 == "教員資料表需修改聘任科別(括號內為該員所對應之聘任科別欄位內容)：江沛潔（特教）（請依欄位說明，修正聘任科別中文名稱。）" & check02$organization_id == "331304", "", check02$flag45)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "331304", "", check02$flag80)
#   #張玉玲 張珊菁 趙珮君 非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：張玉玲 張珊菁 趙珮君（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "331304", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：79人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：88；差異百分比10.2%" & check02$organization_id == "331304", "", check02$flag95)
#   #代理、約聘僱可算全職，可暫不請學校修正 朱玉齡（代理(連) 人事室主任） 劉雅文（代理(連) 藝文中心主任） 蔡玲玲（代理(連) 體發中心主任）； 職員(工)資料表：李熒展（約聘僱 總務處主任）
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：劉雅文（代理(連) 藝文中心主任） 朱玉齡（代理(連) 人事室主任） 蔡玲玲（代理(連) 體發中心主任）； 職員(工)資料表：李熒展（約聘僱 總務處主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "331304", "", check02$flag96)
#   #教育學院學校行政在職碩士專班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：蔡玲玲（碩士學位畢業系所（一）：教育學院學校行政在職碩士專班）" & check02$organization_id == "331304", "", check02$spe6)
# 
# #私立東方工商(331402)
#   #確實沒有設置教務處主管 輔導室主管 圖書館主管 人事室主管 主（會）計室主管，圖書館目前是由教師去管 學生人數太少 沒有圖書館主管的編制或職稱
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：教務處主管 輔導室主管 圖書館主管 人事室主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "331402", "", check02$flag1)
#   #呂桂芳（0360220）出生年月日無誤
# check02$flag7 <- if_else(check02$flag7 == "職員(工)資料表：呂桂芳（0360220）（請確認出生年月日是否正確）" & check02$organization_id == "331402", "", check02$flag7)
#   #推廣教育業務 無誤
# check02$flag49 <- if_else(check02$flag49 != "" & check02$organization_id == "331402", "", check02$flag49)
#   #推廣教育業務 無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "331402", "", check02$flag62)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "331402", "", check02$flag80)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：7人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：8；差異百分比12.5%" & check02$organization_id == "331402", "", check02$flag95)
#   #李崇懿，美國	加州大學洛杉磯分校	教育行政
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：李崇懿（碩士學位畢業系所（一）：教育行政）" & check02$organization_id == "331402", "", check02$spe6)
# 
# #私立喬治工商(331403)
#   #輔導室主管 暫缺，確實沒有設置圖書館主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：輔導室主管 圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "331403", "", check02$flag1)
#   #沒有設置科主任
# check02$flag2 <- if_else(check02$flag2 == "請學校確認是否設置科主任或學程主任" & check02$organization_id == "331403", "", check02$flag2)
#   #放過學校 教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "331403", "", check02$flag18)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "331403", "", check02$flag80)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：23人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：19；差異百分比-21.1%" & check02$organization_id == "331403", "", check02$flag95)
#   #代理可算全職，可暫不請學校修正 俞永嘉（代理(連) 教務處主任） 張月珠（代理(連) 實習處主任）（代理(連) 人事室1主任）（代理(連) 總務處主任）
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：俞永嘉（代理(連) 教務處主任） 張月珠（代理(連) 實習處主任）（代理(連) 人事室1主任）（代理(連) 總務處主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "331403", "", check02$flag96)
#   #聘任訖日確實為實際聘約日(校長)
# check02$flag102 <- if_else(check02$flag102 == "教員資料表：高國慶（1150731）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "331403", "", check02$flag102)
# 
# #私立開平餐飲(331404)
#   #會計室主管 暫缺，確實沒有設置總務處主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：總務處主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "331404", "", check02$flag1)
#   #輔導室主任 實習輔導處主任
# check02$flag18 <- if_else(check02$flag18 == "輔導室主管（主任）人數超過一位，請再協助確認實際聘任情況。" & check02$organization_id == "331404", "", check02$flag18)
#   #王儷燕 許之瑋 非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：王儷燕 許之瑋（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "331404", "", check02$flag86)
#   #該員為技術教師 故最高學歷不為大專以上給過
# check02$flag89 <- if_else(check02$flag89 == "教員資料表：周家銜（請再協助確認渠等人員畢業學歷）" & check02$organization_id == "331404", "", check02$flag89)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：35人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：46；差異百分比23.9%" & check02$organization_id == "331404", "", check02$flag95)
#   #代理可算全職，可暫不請學校修正 劉姿瑩（代理(連) 輔導處輔導主任）
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：劉姿瑩（代理(連) 輔導處輔導主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "331404", "", check02$flag96)
#   #馬嘉延（本校到職前學校服務總年資：0711） 民國102年到職 過去年資為0711 正確
# check02$flag100 <- if_else(check02$flag100 == "馬嘉延（本校到職前學校服務總年資：0711）（校長『本校到職前學校服務總年資』似偏少，請確認校長以本校『校長身分』就任之日期，此日期請填在『本校到職日期』；校長在就任日期前，在本校及他校擔任教師與主任等全職工作之年資，請填在『本校到職前學校服務總年資』。）" & check02$organization_id == "331404", "", check02$flag100)
#   #聘任訖日確實為實際聘約日
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "331404", "", check02$flag102)
#   #吳侑諭（碩士學位畢業系所（一）：COLLEGE OF LAW） 正確
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：吳侑諭（碩士學位畢業系所（一）：COLLEGEOFLAW）" & check02$organization_id == "331404", "", check02$spe6)
# 
# #市立和平高中(333301)
#   #職員(工)資料表：潘麗卿56歲，但學校工作總年資有39年（約17歲開始工作）這是正確的
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，職員(工)資料表：潘麗卿56歲，但學校工作總年資有39年（約17歲開始工作）" & check02$organization_id == "333301", "", check02$flag39)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：149人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：152；差異百分比2.0%" & check02$organization_id == "333301", "", check02$flag95)
# 
# #市立芳和實驗中學(333304)
#   #學校編制特別 課程發展中心主任 學生事務中心主任 行政管理中心主任 學生輔導中心主任 實驗新創中心主任 外展探索中心主任 學習資源中心主任 學習資源中心圖書設備組長
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：教務處主管 總務處主管 圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "333304", "", check02$flag1)
#   #賴英宏 陳孟歆 黃筱晴 非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：賴英宏 陳孟歆 黃筱晴（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "333304", "", check02$flag86)
#   #余怡青 吳菁容 黃紋嫀(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 余怡青 吳菁容 黃紋嫀（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "333304", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：96人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：91；差異百分比-5.5%" & check02$organization_id == "333304", "", check02$flag95)
# 
# #市立大安高工(333401)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：278人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：276；差異百分比-0.7%" & check02$organization_id == "333401", "", check02$flag95)
# 
# #私立大同高中(341302)
#   #確實沒有設置圖書館主管 實習處主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 實習處主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "341302", "", check02$flag1)
#   #沒有設置科主任或學程主任
# check02$flag2 <- if_else(check02$flag2 == "請學校確認是否設置科主任或學程主任" & check02$organization_id == "341302", "", check02$flag2)
#   #戴晨修 非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：戴晨修（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "341302", "", check02$flag86)
#   #胡景山 黃萬福(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 胡景山 黃萬福（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "341302", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：35人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：35；差異百分比0.0%" & check02$organization_id == "341302", "", check02$flag95)
#   #國立政治大學	學校行政碩士 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：林豊翔（碩士學位畢業系所（一）：學校行政）" & check02$organization_id == "341302", "", check02$spe6)
# 
# #私立稻江護家(341402)
#   #圖書館主管為組長
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "341402", "", check02$flag1)
#   #輔導室主任 實習輔導處主任
# check02$flag18 <- if_else(check02$flag18 == "輔導室主管（主任）人數超過一位，請再協助確認實際聘任情況。" & check02$organization_id == "341402", "", check02$flag18)
#   #推廣教育處 正確
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "341402", "", check02$flag62)
#   #張巧青 陳佳慧 非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：張巧青 陳佳慧（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "341402", "", check02$flag86)
#   #李金寰 鄧明娟 上期基準日前離職
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 李金寰 鄧明娟（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "341402", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：59人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：58；差異百分比-1.7%" & check02$organization_id == "341402", "", check02$flag95)
# # #  #世界新聞專科學校	報業行政 正確
# # # check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：黃智柔（副學士或專科畢業科系（一）：報業行政）" & check02$organization_id == "341402", "", check02$spe6)
# 
# #市立中山女中(343301)
#   #主（會）計室主管 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "343301", "", check02$flag1)
#   #呂慶書 張嘉娟 李青芳 薛樂蓉 非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：呂慶書 張嘉娟 李青芳 薛樂蓉（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "343301", "", check02$flag86)
#   #李淑雲 王怡心 魏豐閩(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 李淑雲 王怡心 魏豐閩（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "343301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：162人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：162；差異百分比0.0%" & check02$organization_id == "343301", "", check02$flag95)
#   #國立政治大學	學校行政碩士在職專班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：張云棻（碩士學位畢業系所（一）：學校行政碩士在職專班）" & check02$organization_id == "343301", "", check02$spe6)
# 
# #市立大同高中(343302)
# # #   #鐘點教師	聘任科別：本土語 這次可給通過
# # # check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，教員資料表：張炳森85歲，但學校工作總年資有0年（約85歲開始工作）" & check02$organization_id == "343302", "", check02$flag39)
# # #   #倪達俊 江毅中 蕭玉琴 非本學期退休或因故離職人員
# # # check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "343302", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：177人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：192；差異百分比7.8%" & check02$organization_id == "343302", "", check02$flag95)
# 
# #市立大直高中(343303)
#   #吳淑珍 非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "343303", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：150人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：159；差異百分比5.7%" & check02$organization_id == "343303", "", check02$flag95)
# 
# #私立強恕中學(351301)
#   #總務處主管 輔導室主管 主（會）計室主管 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：總務處主管 輔導室主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "351301", "", check02$flag1)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：12人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：11；差異百分比-9.1%" & check02$organization_id == "351301", "", check02$flag95)
#   #新南威爾斯大學	教育行政
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：盧紅芬（碩士學位畢業系所（一）：教育行政）" & check02$organization_id == "351301", "", check02$spe6)
# 
# #臺北市開南高中(351402)
#   #確實沒有設置輔導室主管 圖書館主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：輔導室主管 圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "351402", "", check02$flag1)
#   #放過學校 教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "351402", "", check02$flag18)
#   #何佳芸（職務名稱：約雇職員） 余家瑋（職務名稱：約雇職員） 黃舲（職務名稱：約雇職員） 楊惠星（職務名稱：約雇職員） 顏莉庭（職務名稱：約雇職員），職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "351402", "", check02$flag62)
#   #廖霙瑞 非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：廖霙瑞（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "351402", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：42人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：53；差異百分比20.8%" & check02$organization_id == "351402", "", check02$flag95)
#   #約聘僱可算全職，可暫不請學校修正
# check02$flag96 <- if_else(check02$flag96 == "職員(工)資料表：劉淑玲（約聘僱 總務處總務主任） 房佳樺（約聘僱 會計室會計主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "351402", "", check02$flag96)
#   #國立政治大學	學校行政碩士在職專班
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：黃瑛修（碩士學位畢業系所（一）：學校行政碩士在職專班）" & check02$organization_id == "351402", "", check02$spe6)
# 
# #私立南華高中進修學校(351B09)
#   #確實沒有設置圖書館主管 人事室主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "351B09", "", check02$flag1)
#   #進修學校，主聘單位全部都填"高中部進修部"
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表主聘單位各類別人數分布異常，請再協助確認實際聘任情況。；教員資料表主聘單位各類別人數分布異常，請再協助確認實際聘任情況。" & check02$organization_id == "351B09", "", check02$flag18)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：19人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：19；差異百分比0.0%" & check02$organization_id == "351B09", "", check02$flag95)
#   #莊惠安（本校到職前學校服務總年資：0600） 民國92年到職 過去年資為6年 正確
# check02$flag100 <- if_else(check02$flag100 == "莊惠安（本校到職前學校服務總年資：0600）（校長『本校到職前學校服務總年資』似偏少，請確認校長以本校『校長身分』就任之日期，此日期請填在『本校到職日期』；校長在就任日期前，在本校及他校擔任教師與主任等全職工作之年資，請填在『本校到職前學校服務總年資』。）" & check02$organization_id == "351B09", "", check02$flag100)
# 
# #市立建國中學(353301)
#   #王宏仁 王曼莉 朱伊雯 吳昌政 李宗憙 張承心 張園笙 傅俊騰 曾寶惠 謝豐如 非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "353301", "", check02$flag86)
#   #曾奕勛(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 曾奕勛（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "353301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：209人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：212；差異百分比1.4%" & check02$organization_id == "353301", "", check02$flag95)
#   #劉燕孝（碩士學位畢業學校（一）：德州農工大學） 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：劉燕孝（碩士學位畢業學校（一）：德州農工大學）" & check02$organization_id == "353301", "", check02$spe6)
# 
# #市立成功中學(353302)
#   #林玲蓉（學士學位畢業科系（一）：THE DEPARTMENT OF ENGLISH LITERATURE，COLLEGE OF HUMANITIES AND SCIENCES） 陳怡文（學士學位畢業科系（一）：外國語系日語專業）
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：林玲蓉（學士學位畢業科系（一）：THEDEPARTMENTOFENGLISHLITERATURE，COLLEGEOFHUMANITIESANDSCIENCES） 陳怡文（學士學位畢業科系（一）：外國語系日語專業）" & check02$organization_id == "353302", "", check02$spe6)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：160人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：167；差異百分比4.2%" & check02$organization_id == "353302", "", check02$flag95)
#   #聘任訖日確實為實際聘約日
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "353302", "", check02$flag102)
# 
# #市立北一女中(353303)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：183人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：179；差異百分比-2.2%" & check02$organization_id == "353303", "", check02$flag95)
# 
# #臺北市靜修高中(361301)
#   #確實沒有設置實習處主管 人事室主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：實習處主管 人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "361301", "", check02$flag1)
#   #沒有設置科主任或學程主任
# check02$flag2 <- if_else(check02$flag2 == "請學校確認是否設置科主任或學程主任" & check02$organization_id == "361301", "", check02$flag2)
# # #  #約聘僱可算全職，可暫不請學校修正
# # # check02$flag90 <- if_else(check02$flag90 == "姓名：邱雅萍（約聘僱）（人事資料顯示該教師兼任行政職務）（校內行政職務原則由專任教師兼任，請協助再確認上述教師是否兼任行政職，或協助再確認上述教師之聘任類別）" & check02$organization_id == "361301", "", check02$flag90)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：78人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：81；差異百分比3.7%" & check02$organization_id == "361301", "", check02$flag95)
#   #國立臺灣師範大學	教育學院教育學系學校行政班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：陳蕾如（碩士學位畢業系所（一）：教育學院教育學系學校行政班）" & check02$organization_id == "361301", "", check02$spe6)
# 
# #私立稻江高商(361401)
#   #確實沒有設置圖書館主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "361401", "", check02$flag1)
#   #林河滇（0371012）出生年月日無誤
# check02$flag7 <- if_else(check02$flag7 == "教員資料表：林河滇（0371012）（請確認出生年月日是否正確）" & check02$organization_id == "361401", "", check02$flag7)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "361401", "", check02$flag80)
#   #王學偉 吳麗娃 陳喬葒 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "361401", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：42人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：33；差異百分比-27.3%" & check02$organization_id == "361401", "", check02$flag95)
# 
# #私立志仁中學進修學校(361B09)
#   #圖書館主任編制在總務處下
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "361B09", "", check02$flag1)
#   #放過學校 教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "361B09", "", check02$flag18)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "361B09", "", check02$flag80)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：29人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：14；差異百分比-107.1%" & check02$organization_id == "361B09", "", check02$flag95)
#   #臺灣師範大學	健康促進與衛生教育學系學校衛生組 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：陳玉櫻（碩士學位畢業系所（一）：健康促進與衛生教育學系學校衛生組）" & check02$organization_id == "361B09", "", check02$spe6)
# 
# #市立明倫高中(363301)
#   #田國瑞 倪超倫 傅義焜(上期flag86)
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "363301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：120人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：125；差異百分比4.0%" & check02$organization_id == "363301", "", check02$flag95)
#   #國立政治大學	學校行政碩士在職專班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：蔡旻錡（碩士學位畢業系所（一）：學校行政碩士在職專班）" & check02$organization_id == "363301", "", check02$spe6)
# 
# #市立成淵高中(363302)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：167人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：166；差異百分比-0.6%" & check02$organization_id == "363302", "", check02$flag95)
#   #斐立安.法蕾萳 正確
# check02$flag98 <- if_else(check02$flag98 == "教員資料表：請確認該員基本資料：斐立安.法蕾萳（姓名）" & check02$organization_id == "363302", "", check02$flag98)
#   #國立政治大學	學校行政碩士 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：蔡宗湶（碩士學位畢業系所（一）：學校行政碩士）； 職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：李建南（碩士學位畢業系所（一）：學校行政碩士）" & check02$organization_id == "363302", "", check02$spe6)
# 
# #市立華江高中(373301)
#   #黃品雲 楊雅惠 賈雪妮 賴駿朋 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "373301", "", check02$flag86)
#   #林尚節 陳春梅(上期flag86)
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "373301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：116人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：122；差異百分比4.9%" & check02$organization_id == "373301", "", check02$flag95)
# 
# #市立大理高中(373302)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：110人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：116；差異百分比5.2%" & check02$organization_id == "373302", "", check02$flag95)
#  
# #國立政大附中(380301)
#   #高淑女 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "380301", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：83人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：85；差異百分比2.4%" & check02$organization_id == "380301", "", check02$flag95)
#   #專任教師兩年一聘、校長四年一聘
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "380301", "", check02$flag102)
# 
# #私立東山高中(381301)
#   #蔡佩???（兼任行政職服務單位(一)：教務處音樂中心 兼任行政職職稱(一)：組長），職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "381301", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：154人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：177；差異百分比13.0%" & check02$organization_id == "381301", "", check02$flag95)
# 
# #私立滬江高中(381302)
#   #確實沒有設置輔導室主管 圖書館主管 實習處主管 人事室主管 主（會）計室
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：輔導室主管 圖書館主管 實習處主管 人事室主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "381302", "", check02$flag1)
#   #輔導室、會計室、人事室的主管為組長，職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "381302", "", check02$flag62)
#   #正確姓名為 姜政江 上期資料打錯字
# check02$flag91 <- if_else(check02$flag91 == "請確認：姜振江/姜政江（離退人員於上一期資料填報姓名與本次資料不相同。請務必確認修正，如已更名，請來電告知。）" & check02$organization_id == "381302", "", check02$flag91)
#   #周淑萍 耿芥 確實為上學年教職員工 上期基準日後到職 本期基準日前離職
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 周淑萍 耿芥（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "381302", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：24人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：23；差異百分比-4.3%" & check02$organization_id == "381302", "", check02$flag95)
#   #代理可算全職 可暫不請學校修正
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：陳銘華（代理(連) 總務處主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "381302", "", check02$flag96)
#   #葉紘維（碩士學位畢業學校（一）：GEORGIA INSTITUTE OF TECHNOLOGY (USA)） 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：葉紘維（碩士學位畢業學校（一）：GEORGIAINSTITUTEOFTECHNOLOGY(USA)） 陳曄玲（碩士學位畢業系所（一）：學校教育研究科）" & check02$organization_id == "381302", "", check02$spe6)
# 
# #私立大誠高中(381303)
#   #圖書館主管 人事室主管 暫缺，有實習組長，未來應該會不設置實習處
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 實習處主管 人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "381303", "", check02$flag1)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：23人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：15；差異百分比-53.3%" & check02$organization_id == "381303", "", check02$flag95)
# 
# #私立再興中學(381304)
#   #確實沒有設置圖書館主管，僅有組長
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "381304", "", check02$flag1)
#   #圖書室的主管為組長，職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "381304", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：89人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：89；差異百分比0.0%" & check02$organization_id == "381304", "", check02$flag95)
# 
# #私立景文高中(381305)
#   #確實沒有設置實習處主管，僅有組長
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：實習處主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "381305", "", check02$flag1)
#   #確實沒有設置科主任或學程主任
# check02$flag2 <- if_else(check02$flag2 == "請學校確認是否設置科主任或學程主任" & check02$organization_id == "381305", "", check02$flag2)
# # #   #兼任教師連續聘任不中斷無誤
# # # check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "381305", "", check02$flag80)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：65人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：64；差異百分比-1.6%" & check02$organization_id == "381305", "", check02$flag95)
#   #校長
# check02$flag102 <- if_else(check02$flag102 == "教員資料表：江岳勳（1160731）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "381305", "", check02$flag102)
#   #國立政治大學	學校行政所 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：蘇麗美（碩士學位畢業系所（一）：學校行政所）" & check02$organization_id == "381305", "", check02$spe6)
# 
# #臺北市靜心高中(381306)
#   #一位主任 一位人事管理員 正確
# check02$flag18 <- if_else(check02$flag18 == "人事室主管（主任）人數超過一位，請再協助確認實際聘任情況。" & check02$organization_id == "381306", "", check02$flag18)
#   #約聘僱可算全職 可暫不請學校修正，代理教師兼任教務處主任、圖書館主任 先給通過
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：林逸萍（代理(連) 教務處主任） 莊子賢（代理(連) 圖書館主任）； 職員(工)資料表：王舒葳（約聘僱 英語中心主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "381306", "", check02$flag96)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：64人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：75；差異百分比14.7%" & check02$organization_id == "381306", "", check02$flag95)
#   #聘任訖日 正確
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "381306", "", check02$flag102)
#   #國立中興大學	教師專業發展研究所 正確、陸軍官校	軍事情報學校特研班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：陳翊萍（碩士學位畢業系所（一）：教師專業發展研究所）； 職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：徐良璧（學士學位畢業科系（一）：軍事情報學校特研班）" & check02$organization_id == "381306", "", check02$spe6)
# 
# #市立景美女中(383301)
# # #   #扣除年資不為零的人數確實偏高
# # # check02$flag64 <- if_else(check02$flag64 == "扣除年資不為零的人數似偏高，請再依欄位說明確認。" & check02$organization_id == "383301", "", check02$flag64)
#   #林子棠 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "383301", "", check02$flag86)
#   #國立政治大學 學校行政研究所 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：周寤竹（碩士學位畢業系所（一）：學校行政研究所）" & check02$organization_id == "383301", "", check02$spe6)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：139人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：144；差異百分比3.5%" & check02$organization_id == "383301", "", check02$flag95)
# 
# #市立萬芳高中(383302)
#   #本項目不需請學校修正
#   check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：141人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：143；差異百分比1.4%" & check02$organization_id == "383302", "", check02$flag95)
# 
# #市立數位實驗高中(383303)
#   #沒有學務處 輔導室 有設學輔處、沒有設置圖書館、人事室暫無主管(人事主任目前是由大安高工人事組員兼任人事主任)
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：學務處主管 輔導室主管 圖書館主管 人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "383303", "", check02$flag1)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：20人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：26；差異百分比23.1%" & check02$organization_id == "383303", "", check02$flag95)
# 
# #市立木柵高工(383401)
#   #楊欣琪 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "383401", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：170人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：157；差異百分比-8.3%" & check02$organization_id == "383401", "", check02$flag95)
# 
# #市立南港高中(393301)
#   #補校教務組 補校訓導組 專任行政助理(臨時人員) 正確
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "393301", "", check02$flag62)
#   #專任教師謝雅苓，112/08/01離職後，1131又回來擔任專任教師
# check02$flag83 <- if_else(check02$flag83 == "教員資料表：謝雅苓（請確認上述人員是否退休、退伍或因故離職，若是，則不需填列至本次教員資料表或職員（工）資料表，並請依欄位說明確認離退職類別）" & check02$organization_id == "393301", "", check02$flag83)
#   #李欣燕 莊銘宏 蔡淑芳 邱禾倫 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：李欣燕 莊銘宏 蔡淑芳 邱禾倫（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "393301", "", check02$flag86)
#   #忻凌琳 謝雅苓(上期flag86)
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "393301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：155人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：160；差異百分比3.1%" & check02$organization_id == "393301", "", check02$flag95)
#   #國立政治大學	學校行政碩士 正確
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：謝鎧旭（碩士學位畢業系所（一）：學校行政碩士）" & check02$organization_id == "393301", "", check02$spe6)
# 
# #市立育成高中(393302)
#   #廖沚懷 李沂羲 莊景智 陳建平 以上4人在1121資料誤植為專任，應為代理，故1131不填在離退資料表。
# check02$flag86 <- if_else(check02$flag86 == "姓名：廖沚懷 李沂羲 莊景智 陳建平（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "393302", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：140人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：142；差異百分比1.4%" & check02$organization_id == "393302", "", check02$flag95)
#   #聘任訖日 正確
# check02$flag102 <- if_else(check02$flag102 == "職員(工)資料表：楊莉莉（1140831）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "393302", "", check02$flag102)
#   #林倩穗（學士學位畢業學校（一）：日本國立熊本商科大學） 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：林倩穗（學士學位畢業學校（一）：日本國立熊本商科大學）" & check02$organization_id == "393302", "", check02$spe6)
# 
# #市立南港高工(393401)
#   #確實設置學安室
#   check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "393401", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：201人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：197；差異百分比-2.0%" & check02$organization_id == "393401", "", check02$flag95)
# 
# #私立文德女中(401301)
#   #確實沒有設置學務處主管 輔導室主管 圖書館主管 人事室主管 主（會）計室主管(將停招)
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：學務處主管 輔導室主管 圖書館主管 人事室主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "401301", "", check02$flag1)
#   #放過學校 教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "401301", "", check02$flag18)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：5人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：4；差異百分比-25.0%" & check02$organization_id == "401301", "", check02$flag95)
# 
# # # #私立方濟中學(401302)
# # #  #確實沒有設置圖書館主管 主（會）計室主管，僅分別設有管理員、會計員
# # # check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "401302", "", check02$flag1)
# # #  #本項目不需請學校修正
# # # check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：16人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：10；差異百分比-60.0%" & check02$organization_id == "401302", "", check02$flag95)
# # #   #胡嘉強（本校到職前學校服務總年資：0000） 該校校長是董事會找的人員來代理校長，從107年開始一直擔任校長到現在，過去沒有擔任教師或學校服務的經驗，所以到職前年資是0000
# # # check02$flag100 <- if_else(check02$flag100 == "胡嘉強（本校到職前學校服務總年資：0000）（校長『本校到職前學校服務總年資』似偏少，請確認校長以本校『校長身分』就任之日期，此日期請填在『本校到職日期』；校長在就任日期前，在本校及他校擔任教師與主任等全職工作之年資，請填在『本校到職前學校服務總年資』。）" & check02$organization_id == "401302", "", check02$flag100)
# 
# #私立達人女中(401303)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "401303", "", check02$flag18)
#   #林珮甄（職務名稱：職員），職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "401303", "", check02$flag62)
#   #專任教師林碧菁，112/08/01退休後，1131又回來擔任代理教師
# check02$flag83 <- if_else(check02$flag83 == "教員資料表：林碧菁（請確認上述人員是否退休、退伍或因故離職，若是，則不需填列至本次教員資料表或職員（工）資料表，並請依欄位說明確認離退職類別）" & check02$organization_id == "401303", "", check02$flag83)
#   #教師林碧菁，112/08/01以專任身分退休，112/09/30改聘代理，故上期(1121)資料為代理的教師，本期(1131)填列在離退表
# check02$flag84 <- if_else(check02$flag84 == "教員：林碧菁（查貴校上一學年所填資料，上述人員聘任類別非屬『專任』。依欄位說明，非專任教職員(工)之退休或離職者，不須填列離退教職員(工)資料表，請務必再確認。）" & check02$organization_id == "401303", "", check02$flag84)
#   #劉志偉 蔡美雯 蘇縈懷 陳碧玉 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：劉志偉 蔡美雯 蘇縈懷 陳碧玉（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "401303", "", check02$flag86)
#   #吳季倫 施佳慧 洪碧彩 許紋馨 許瑞敏 楊士弘 劉逸竹(上期flag86)
# check02$flag93 <- if_else(check02$flag93 != "" & check02$organization_id == "401303", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：52人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：52；差異百分比0.0%" & check02$organization_id == "401303", "", check02$flag95)
#   #約聘僱可算全職，可暫不請學校修正
# check02$flag96 <- if_else(check02$flag96 == "職員(工)資料表：吳景蓉（約聘僱 會計室主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "401303", "", check02$flag96)
# 
# #市立內湖高中(403301)
#   #李玫 李錦慧 林貞均 林素娥 茆健忠 許英修 陳昭瑋 陳華姿 曾羽龍 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "403301", "", check02$flag86)
#   #張文駿 黃竣貿(上期flag93)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 張文駿 黃竣貿（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "403301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：143人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：140；差異百分比-2.1%" & check02$organization_id == "403301", "", check02$flag95)
# 
# #市立麗山高中(403302)
#   #兼任教師、長期代課教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "403302", "", check02$flag80)
#   #李秀惠 隆世秀 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "403302", "", check02$flag86)
#   #呂雅玲(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 呂雅玲（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "403302", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：86人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：89；差異百分比3.4%" & check02$organization_id == "403302", "", check02$flag95)
# 
# #市立南湖高中(403303)
#   #李小蘭 盧慧娜 陳秀慧 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：李小蘭 盧慧娜 陳秀慧（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "403303", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：117人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：118；差異百分比0.8%" & check02$organization_id == "403303", "", check02$flag95)
# 
# #市立內湖高工(403401)
#   #出生年月日0720206 教官退休 正確
# check02$flag85 <- if_else(check02$flag85 == "教員資料表：許仕甫（該員年齡似低於最低法定退休年齡，敬請再協助確認）" & check02$organization_id == "403401", "", check02$flag85)
#   #林宴如 蘇之凡 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：林宴如 蘇之凡（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "403401", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：171人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：177；差異百分比3.4%" & check02$organization_id == "403401", "", check02$flag95)
#   #林榆真（碩士學位畢業系所（一）：英語專業溝通與教學科技研究所） 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：林榆真（碩士學位畢業系所（一）：英語專業溝通與教學科技研究所）" & check02$organization_id == "403401", "", check02$spe6)
# 
# #私立泰北高中(411301)
#   #確實沒有設置實習處主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：實習處主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "411301", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低 教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。；教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "411301", "", check02$flag18)
#   #職員(工)：游婕妮，確實是以專任身分離退(轉專任一個月)
# check02$flag84 <- if_else(check02$flag84 == "職員(工)：游婕妮（查貴校上一學年所填資料，上述人員聘任類別非屬『專任』。依欄位說明，非專任教職員(工)之退休或離職者，不須填列離退教職員(工)資料表，請務必再確認。）" & check02$organization_id == "411301", "", check02$flag84)
#   #江瑜 汪金英 胡永生 蔡隸關 謝宜蓁 陳銘志 確實為上學年離退人員
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 江瑜 汪金英 胡永生 蔡隸關 謝宜蓁 陳銘志（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "411301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：51人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：60；差異百分比15.0%" & check02$organization_id == "411301", "", check02$flag95)
#   #張玲玲（碩士學位畢業系所（一）：學校行政碩士在職專班） 鄭鳳綿（碩士學位畢業系所（一）：學校教育行政與評鑑研究所） 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：張玲玲（碩士學位畢業系所（一）：學校行政碩士在職專班） 鄭鳳綿（碩士學位畢業系所（一）：學校教育行政與評鑑研究所）" & check02$organization_id == "411301", "", check02$spe6)
# 
# #私立衛理女中(411302)
#   #確實沒有設置人事室主管 僅有組長
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "411302", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "411302", "", check02$flag18)
#   #服務單位：宗教室 正確、人事室的主管為組長、住校處的主管為組長 職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "411302", "", check02$flag62)
#   #約聘僱教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "411302", "", check02$flag80)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：77人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：78；差異百分比1.3%" & check02$organization_id == "411302", "", check02$flag95)
#   #聘任訖日確實為校長簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 == "教員資料表：徐建國（1150731）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "411302", "", check02$flag102)
#   #駱威帆（碩士學位畢業學校（一）：台灣神學研究院） 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：駱威帆（碩士學位畢業學校（一）：台灣神學研究院）" & check02$organization_id == "411302", "", check02$spe6)
# 
# #私立華興中學(411303)
#   #確實沒有設置圖書館主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "411303", "", check02$flag1)
#   #曾騰瀧（無） 校長沒有授課專長
# check02$flag45 <- if_else(check02$flag45 == "教員資料表需修改聘任科別(括號內為該員所對應之聘任科別欄位內容)：曾騰瀧（無）（請依欄位說明，修正聘任科別中文名稱。）" & check02$organization_id == "411303", "", check02$flag45)
#   #陳媁婷（服務單位：人事室 職務名稱：組長） 職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "411303", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：62人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：61；差異百分比-1.6%" & check02$organization_id == "411303", "", check02$flag95)
#   #聘任訖日確實為校長簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 == "教員資料表：曾騰瀧（1180731）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "411303", "", check02$flag102)
# 
# #私立華岡藝校(411401)
#   #確實沒有設置圖書館主管 實習處主管 主（會）計室主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 實習處主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "411401", "", check02$flag1)
#   #放過學校 教員資料表專任教學人員人數偏低 一年以上與任教領域相關之業界實務工作經驗人數偏多
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。一年以上與任教領域相關之業界實務工作經驗人數偏多（請再協助確認，『是否具備一年以上與任教領域相關之業界實務工作經驗』填寫『Y』之教員，是否確依欄位說明具備此經驗）" & check02$organization_id == "411401", "", check02$flag18)
# # #   #兼任行政職職稱(一)：校護 正確
# # # check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "411401", "", check02$flag62)
#   #莊云婷 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 == "姓名：莊云婷（經比對貴校上一學年所填資料，上述人員並未出現於本學期的教員資料表或職員(工)資料表，請確認渠等是否於112學年度（112年8月1日(含)至113年7月31日(含)）退休或因故離職等，若於該期間退休或因故離職等，應於離退教職員(工)資料表填寫資料。如非於該期間退休或因故離職，或已介聘、調至他校，請來電告知。）" & check02$organization_id == "411401", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：34人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：34；差異百分比0.0%" & check02$organization_id == "411401", "", check02$flag95)
#   #林維仁本學期同時在私立光仁高中(011323)、私立華岡藝校(411401)兼課，光仁高中填報資料為碩士學歷，但華岡藝校認定僅有學士學歷，因該教師僅口頭向華岡藝校說有碩士畢業，但沒有提供碩士學歷證明給華岡藝校，故華岡藝校的人事僅認定他有學士學歷。
# check02$flag98 <- if_else(check02$flag98 == "教員資料表：請確認該員基本資料：林維仁（最高學歷：學士）" & check02$organization_id == "411401", "", check02$flag98)
#   #范昌瑾（碩士學位畢業學校（一）：NEW ENGLAND CONSERVATORY OF MUSIC） 黃翠屏（碩士學位畢業學校（一）：CONSERVATORIO STATALE DIMILANO“GIUSEPPEVERDI”ITALIA）正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：范昌瑾（碩士學位畢業學校（一）：NEWENGLANDCONSERVATORYOFMUSIC）" & check02$organization_id == "411401", "", check02$spe6)
# 
# #市立陽明高中(413301)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：150人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：153；差異百分比2.0%" & check02$organization_id == "413301", "", check02$flag95)
#   #國立政治大學	學校行政碩士在職專班 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：程維煌（碩士學位畢業系所（一）：學校行政碩士在職專班）" & check02$organization_id == "413301", "", check02$spe6)
# 
# #市立百齡高中(413302)
#   #人事室主管 暫缺
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：人事室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "413302", "", check02$flag1)
#   #古舒芬 吳玉梅 吳榮修 林妍孜 林祖宏 姚晉雯 修純慧 喬久娟 黃素琴 詹忠宏 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "413302", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：157人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：161；差異百分比2.5%" & check02$organization_id == "413302", "", check02$flag95)
#   #吳淑楨（碩士學位畢業系所（一）：社會教育學系學校圖書館行政班） 正確 畢業證書確實這樣寫
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：吳淑楨（碩士學位畢業系所（一）：社會教育學系學校圖書館行政班）" & check02$organization_id == "413302", "", check02$spe6)
# 
# #市立士林高商(413401)
#   #黃玉婷16歲開始工作無誤
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，職員(工)資料表：黃玉婷48歲，但學校工作總年資有32年（約16歲開始工作）" & check02$organization_id == "413401", "", check02$flag39)
#   #余熒熒 巫曉芸 李瓊雲 洪子傑 洪華廷 陳婉寧 黃子恩 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "413401", "", check02$flag86)
#   #郭豐銓(去年基準日後到職 今年基準日前離職) 陳澤榮(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 郭豐銓 陳澤榮（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "413401", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：198人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：196；差異百分比-1.0%" & check02$organization_id == "413401", "", check02$flag95)
# # #   #市立內湖高工(403401)溫欣儒 市立士林高商(413401)温欣儒 
# # # check02$flag98 <- if_else(check02$flag98 == "教員資料表：請確認該員基本資料：温欣儒（姓名）" & check02$organization_id == "413401", "", check02$flag98)
# 
# #私立薇閣高中(421301)
#   #確實沒有設置圖書館主管 人事室主管 主（會）計室主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 人事室主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "421301", "", check02$flag1)
#   #國際部、會計室、人事室的主管為組長，職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "421301", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：137人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：138；差異百分比0.7%" & check02$organization_id == "421301", "", check02$flag95)
#   #聘任訖日確實為校長簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 == "教員資料表：孫明峯（1170731）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "421301", "", check02$flag102)
# 
# #臺北市幼華高中(421302)
#   #確實沒有設置圖書館主管 實習處主管 主（會）計室主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管 實習處主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "421302", "", check02$flag1)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "421302", "", check02$flag18)
#   #兼任教師、鐘點教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "421302", "", check02$flag80)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：47人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：51；差異百分比7.8%" & check02$organization_id == "421302", "", check02$flag95)
#   #臺北市幼華高中的校長是教育局官派的(督學)，直接到其他學校擔任校長6年6個月，沒有擔任教師的年資
# check02$flag100 <- if_else(check02$flag100 == "施博惠（本校到職前學校服務總年資：0606）（校長『本校到職前學校服務總年資』似偏少，請確認校長以本校『校長身分』就任之日期，此日期請填在『本校到職日期』；校長在就任日期前，在本校及他校擔任教師與主任等全職工作之年資，請填在『本校到職前學校服務總年資』。）" & check02$organization_id == "421302", "", check02$flag100)
#   #聘任訖日 丁宥席（1150731） 正確
# check02$flag102 <- if_else(check02$flag102 == "教員資料表：丁宥席（1150731）（請確認並依欄位說明修正上開人員之聘任訖日，若確實為其聘任期程之最後一日，請來電告知。）" & check02$organization_id == "421302", "", check02$flag102)
#   #私立淡水工商管理專科學校 正確
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：陳麗金（副學士或專科畢業科系（一）：專科部二年制護理科）" & check02$organization_id == "421302", "", check02$spe6)
# 
# #臺北市私立奎山實驗高級中學(421303)
#   #確實沒有設置圖書館主管 主（會）計室主管，輔導主任有填 隸屬於中學部
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：輔導室主管 圖書館主管 主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "421303", "", check02$flag1)
#   #放過學校 職員(工)資料表主聘單位各類別人數分布異常(`奎山``為實驗學校，不容易區分高中部或中學部，故有4位填"其他"，)
#     # 夏荻	人事室	行政秘書
#     # 馮臨燕	人事室	代理主任
#     # 曾台郇	總務處	總務組長
#     # 杜欣祐	圖書館	組長
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表主聘單位各類別人數分布異常，請再協助確認實際聘任情況。" & check02$organization_id == "421303", "", check02$flag18)
# # # #圖書館的主管為組長，職稱無誤
# # # check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "421303", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：26人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：17；差異百分比-52.9%" & check02$organization_id == "421303", "", check02$flag95)
#   #夏荻（碩士學位畢業學校（一）：DALLAS BAPTIST UNIV.）
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：夏荻（碩士學位畢業學校（一）：DALLASBAPTISTUNIV.）" & check02$organization_id == "421303", "", check02$spe6)
# 
# #私立惇敘工商(421404)
#   #周誼婷(去年基準日後到職 今年基準日前離職)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 周誼婷（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "421404", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：23人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：19；差異百分比-21.1%" & check02$organization_id == "421404", "", check02$flag95)
#   #代理可算全職，可暫不請學校修正 劉定芬（代理 輔導室主任） 謝春華（代理 圖書館主任） 陳柱政（代理 教務處主任）
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：劉定芬（代理 輔導室主任） 謝春華（代理 圖書館主任） 陳柱政（代理 教務處主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "421404", "", check02$flag96)
# 
# #市立復興高中(423301)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：164人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：166；差異百分比1.2%" & check02$organization_id == "423301", "", check02$flag95)
#   #聘任訖日確實為實際聘約日
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "423301", "", check02$flag102)
# 
# #市立中正高中(423302)
#   #張炳森（0270315） 正確 (本土語鐘點教師)
# check02$flag7 <- if_else(check02$flag7 == "教員資料表：張炳森（0270315）（請確認出生年月日是否正確）" & check02$organization_id == "423302", "", check02$flag7)
# # #   #教員資料表專任教學人員人數偏低 給過 鐘點教師中，有63人的聘任科別為音樂，中正高中有藝才班
# # # check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "423302", "", check02$flag18)
#   #鐘點教師	聘任科別：本土語文-閩南語 這次可給通過
# check02$flag39 <- if_else(check02$flag39 == "請確認該員之「本校到職日期」、「本校任職需扣除之年資」、「本校到職前學校服務總年資」，教員資料表：張炳森86歲，但學校工作總年資有1年（約85歲開始工作）" & check02$organization_id == "423302", "", check02$flag39)
#   #謝佩儒（職務名稱：學習歷程檔案充實人力）（請再協助確認上述人員職務正確完整名稱），職稱無誤
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "423302", "", check02$flag62)
#   #周明樂 黃業建(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 周明樂 黃業建（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "423302", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：168人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：175；差異百分比4.0%" & check02$organization_id == "423302", "", check02$flag95)
#   #黃盈媛 黄盈媛
# check02$flag98 <- if_else(check02$flag98 == "教員資料表：請確認該員基本資料：黃盈媛（姓名）" & check02$organization_id == "423302", "", check02$flag98)
#   #國立政治大學	學校行政研究所 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：郭婷婷（碩士學位畢業系所（一）：學校行政研究所）" & check02$organization_id == "423302", "", check02$spe6)
# 
# #天主教明誠高中(521301)
#   #丁姿吟（小學） 小學部教師 通過
# check02$flag45 <- if_else(check02$flag45 == "教員資料表需修改聘任科別(括號內為該員所對應之聘任科別欄位內容)：丁姿吟（小學）（請依欄位說明，修正聘任科別中文名稱。）" & check02$organization_id == "521301", "", check02$flag45)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：51人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：51；差異百分比0.0%" & check02$organization_id == "521301", "", check02$flag95)
#   #國立政治大學	學校行政、國立高雄師範大學 學校行政領導 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：謝怡靜（碩士學位畢業系所（一）：學校行政） 黃冠翔（碩士學位畢業系所（一）：學校行政領導）" & check02$organization_id == "521301", "", check02$spe6)
# 
# #私立大榮高中(521303)
#   #教員王昭月 兼任圖書館主任(圖書館主任隸屬於教務處)
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "521303", "", check02$flag1)
#   #教務處設有英語發展中心主任及高中部主任 總務處設有總務主任及國小總務主任
# check02$flag18 <- if_else(check02$flag18 == "教務處主管（主任）人數超過一位，請再協助確認實際聘任情況。總務處主管（主任）人數超過一位，請再協助確認實際聘任情況。" & check02$organization_id == "521303", "", check02$flag18)
#   #李光庭（兼任行政職服務單位(一)：國小總務處） 正確
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "521303", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：53人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：52；差異百分比-1.9%" & check02$organization_id == "521303", "", check02$flag95)
#   #代理可算全職，可暫不請學校修正
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：李佩齡（代理(連) 教務處英語發展中心主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "521303", "", check02$flag96)
#   #林宗獻（ 技術教師（兼任）） 過去確實取得資格 退休後回來兼任
# check02$flag99 <- if_else(check02$flag99 != "" & check02$organization_id == "521303", "", check02$flag99)
#   #王昭月 國立台灣師範大學	教育學院社會教育系學校圖書館行政班
#   #魏嫻芳 國立中山大學	社會科學學院教育研究所教師在職進修教學及學校行政碩士學位班教學組
#   #同等學歷 工業類電機工程科 
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：王昭月（碩士學位畢業系所（一）：教育學院社會教育系學校圖書館行政班） 魏嫻芳（碩士學位畢業系所（一）：社會科學學院教育研究所教師在職進修教學及學校行政碩士學位班教學組）； 職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：黃明雄（副學士或專科畢業學校（一）：同等學歷）" & check02$organization_id == "521303", "", check02$spe6)
# 
# #私立中華藝校(521401)
#   #確實沒有設置輔導室主管 圖書館主管 實習處主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：輔導室主管 圖書館主管 實習處主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "521401", "", check02$flag1)
#   #放過學校 教員資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "521401", "", check02$flag18)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：48人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：40；差異百分比-20.0%" & check02$organization_id == "521401", "", check02$flag95)
# 
# #私立立志高中(551301)
#   #確實沒有設置主（會）計室主管
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：主（會）計室主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "551301", "", check02$flag1)
#   #柳信榮（0330103） 正確 (對該校來講是顧問 該校以代理教師方式聘他 )
# check02$flag7 <- if_else(check02$flag7 == "教員資料表：柳信榮（0330103）（請確認出生年月日是否正確）" & check02$organization_id == "551301", "", check02$flag7)
#   #鄭鏡成（職務名稱：校車組監理員）
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "551301", "", check02$flag62)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：95人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：90；差異百分比-5.6%" & check02$organization_id == "551301", "", check02$flag95)
#   #江澈（本校到職前學校服務總年資：0700） 民國80年到職 過去年資為7年 正確
# check02$flag100 <- if_else(check02$flag100 == "江澈（本校到職前學校服務總年資：0700）（校長『本校到職前學校服務總年資』似偏少，請確認校長以本校『校長身分』就任之日期，此日期請填在『本校到職日期』；校長在就任日期前，在本校及他校擔任教師與主任等全職工作之年資，請填在『本校到職前學校服務總年資』。）" & check02$organization_id == "551301", "", check02$flag100)
#   #聘任訖日確實為實際聘約日
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "551301", "", check02$flag102)
# 
# #私立樹德家商(551402)
#   #確實沒有設置圖書館主管 (讀者服務組 組長)
# check02$flag1 <- if_else(check02$flag1 == "尚待增補之學校主管：圖書館主管（請確認是否填報完整名單，倘貴校上開主任尚未到職，請來電告知）" & check02$organization_id == "551402", "", check02$flag1)
#   #陳明原（兼任行政職職稱(一)：藝術總監）
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "551402", "", check02$flag62)
#   #兼任教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "551402", "", check02$flag80)
#   #教師孔祥慧 陳淑美 曾素美 虞彬彬，111學年度為專任，112/08/01退休後，112學年度改聘兼任，1131又回聘為代理教師
# check02$flag83 <- if_else(check02$flag83 == "教員資料表：孔祥慧 陳淑美 曾素美 虞彬彬（請確認上述人員是否退休、退伍或因故離職，若是，則不需填列至本次教員資料表或職員（工）資料表，並請依欄位說明確認離退職類別）" & check02$organization_id == "551402", "", check02$flag83)
#   #教師孔祥慧 曾素美 虞彬彬 陳淑美，111學年度為專任，112/08/01退休後，112學年度改聘兼任，1131又回聘為代理教師
# check02$flag84 <- if_else(check02$flag84 == "教員：孔祥慧 曾素美 虞彬彬 陳淑美（查貴校上一學年所填資料，上述人員聘任類別非屬『專任』。依欄位說明，非專任教職員(工)之退休或離職者，不須填列離退教職員(工)資料表，請務必再確認。）" & check02$organization_id == "551402", "", check02$flag84)
#   #李如倩 林傭順 高儀晉 陳智惠 陳溫偉 劉柔希 蔡碧女 鄧朱雅 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "551402", "", check02$flag86)
#   #徐麗華 李淑如 李豐昌 解佳蓉 許裕琴 趙自屏 陳映如(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 徐麗華 李淑如 李豐昌 解佳蓉 許裕琴 趙自屏 陳映如（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "551402", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：148人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：154；差異百分比3.9%" & check02$organization_id == "551402", "", check02$flag95)
#   #林靜瑩（副學士或專科畢業學校（一）：自學進修學力鑑定） 正確
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：林靜瑩（副學士或專科畢業學校（一）：自學進修學力鑑定）" & check02$organization_id == "551402", "", check02$spe6)
#   #聘任訖日確實為實際聘約日
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "551402", "", check02$flag102)
# 
# #私立復華高中(581301)
#   #放過學校 職員(工)資料表專任人員人數偏低 教員資料表專任教學人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。；教員資料表專任教學人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整教員名單資料。" & check02$organization_id == "581301", "", check02$flag18)
#   #徐碩呈 張簡毓蕙 黃美榛 楊淑芬 皆非本學期退休或因故離職人員
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "581301", "", check02$flag86)
#   #余麗娟 吳碧仙 孫淑貞 蔡婉君(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 余麗娟 吳碧仙 孫淑貞 蔡婉君（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "581301", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：55人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：49；差異百分比-12.2%" & check02$organization_id == "581301", "", check02$flag95)
#   #代理、約聘僱可算全職，可暫不請學校修正 教員資料表：柯東育（代理(連) 國小部主任） 徐瑞爐（代理(連) 輔導室主任） 翁明國（代理(連) 學生事務處主任） 楊順惠（代理(連) 國中部主任）； 職員(工)資料表：王詠惠（約聘僱 圖書館主任）
# check02$flag96 <- if_else(check02$flag96 == "教員資料表：徐瑞爐（代理(連) 輔導室主任） 柯東育（代理(連) 國小部主任） 楊順惠（代理(連) 實習處主任）（代理(連) 國中部主任） 翁明國（代理(連) 學生事務處主任）； 職員(工)資料表：王詠惠（約聘僱 圖書館主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "581301", "", check02$flag96)
#   #聘任訖日確實為專任教師簽的聘約日期
# check02$flag102 <- if_else(check02$flag102 != "" & check02$organization_id == "581301", "", check02$flag102)
#   #劉久美（碩士學位畢業學校（一）：德州農工大學） 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：劉久美（碩士學位畢業學校（一）：德州農工大學）" & check02$organization_id == "581301", "", check02$spe6)
# 
# #天主教道明中學(581302)
#   #教務處	音樂教育中心主任
#   #教務處	教務主任
#   #教務處	美術教育中心主任
# check02$flag18 <- if_else(check02$flag18 == "教務處主管（主任）人數超過一位，請再協助確認實際聘任情況。" & check02$organization_id == "581302", "", check02$flag18)
#   #護士師 正確
# check02$flag62 <- if_else(check02$flag62 != "" & check02$organization_id == "581302", "", check02$flag62)
#   #長期代課教師連續聘任不中斷無誤
# check02$flag80 <- if_else(check02$flag80 != "" & check02$organization_id == "581302", "", check02$flag80)
#   #李鎮光(上期flag86)
# check02$flag93 <- if_else(check02$flag93 == "離退教職員(工)資料表： 李鎮光（查貴校上一學年所填資料，上述人員未在貴校教職員(工)資料中，請確認上述人員是否於112學年度（112年8月1日(含)至113年7月31日(含)）有退休或因故離職之情形，或是否屬於貴校教職員(工)，併請確認貴校教職員工名單是否完整正確。）" & check02$organization_id == "581302", "", check02$flag93)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：155人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：160；差異百分比3.1%" & check02$organization_id == "581302", "", check02$flag95)
# 
# #私立三信家商(581402)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "581402", "", check02$flag18)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：70人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：57；差異百分比-22.8%" & check02$organization_id == "581402", "", check02$flag95)
#   #約聘僱可算全職，可暫不請學校修正 林富苓（約聘僱 總務處主任） 邱士賢（約聘僱 招生中心主任） 鄒宇虹（約聘僱 人事室主任）
# check02$flag96 <- if_else(check02$flag96 == "職員(工)資料表：林富苓（約聘僱 總務處主任） 楊文賓（約聘僱 圖資處主任） 邱士賢（約聘僱 招生中心主任） 鄒宇虹（約聘僱 人事室主任）（校內一級主管（主任）原則由專任教職員擔（兼）任，請協助再確認上述教職員是否擔（兼）任校內一級主管（主任），或協助再確認上述教職員之聘任類別）" & check02$organization_id == "581402", "", check02$flag96)
#   #兵庫教育大學 學校教育學 正確
# check02$spe6 <- if_else(check02$spe6 == "教員資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：陳紀蓉（碩士學位畢業系所（一）：學校教育學）" & check02$organization_id == "581402", "", check02$spe6)
# 
# #國立馬祖高中(720301)
#   #沒有設置學程主任
# check02$flag3 <- if_else(check02$flag3 == "請學校確認是否設置學程主任" & check02$organization_id == "720301", "", check02$flag3)
#   #放過學校 職員(工)資料表專任人員人數偏低
# check02$flag18 <- if_else(check02$flag18 == "職員(工)資料表專任人員人數偏低，請再協助確認實際聘任情況，或請確認是否填報完整職員(工)名單資料。" & check02$organization_id == "720301", "", check02$flag18)
#   #吳佳興 劉菊嬌 皆非本學期退休或因故離職人員(在113/2/1前離職，上期離退表忘記填))
# check02$flag86 <- if_else(check02$flag86 != "" & check02$organization_id == "720301", "", check02$flag86)
#   #本項目不需請學校修正
# check02$flag95 <- if_else(check02$flag95 == "統計處專任教師人數：33人；本資料庫專任教師、代理教師、校長、教官、主任教官人數：34；差異百分比2.9%" & check02$organization_id == "720301", "", check02$flag95)
#   #國立臺北商業大學附設空中學院專科部 國立澎湖海事管理專科學校 正確
# check02$spe6 <- if_else(check02$spe6 == "職員(工)資料表之大學（學士）以上各教育階段學歷資料不完整或不正確：李沛涵（副學士或專科畢業學校（一）：國立臺北商業大學附設空中學院專科部） 郭敏慧（副學士或專科畢業學校（一）：國立澎湖海事管理專科學校）" & check02$organization_id == "720301", "", check02$spe6)

check02$err_flag <- 0

temp <- c("flag1", "flag2", "flag3", "flag6", "flag7", "flag8", "flag9", "flag15", "flag16", "flag18", "flag20", "flag24", "flag39", "flag45", "flag47", "flag48", "flag49", "flag50", "flag51", "flag52", "flag57", "flag59", "flag62", "flag64", "flag80", "flag82", "flag83", "flag84", "flag85", "flag86", "flag89", "flag90", "flag91", "flag92", "flag93", "flag94", "flag95", "flag96", "flag97", "flag98", "flag99", "flag100", "flag102", "flag103", "spe3", "spe5", "spe6")
for (i in temp){
  check02[[i]] <- if_else(is.na(check02[[i]]), "", check02[[i]])
  check02$err_flag <- if_else(nchar(check02[[i]]) != 0, 1, check02$err_flag)
}

#刪除無錯誤的學校
check02 <- check02 %>%
  subset(err_flag != 0)

if (dim(check02)[1] != 0){
#標誌出無錯誤的處室
check02$err_flag_P <- 0
check02$err_flag_Ps <- 0
temp <- c("flag1", "flag2", "flag3", "flag6", "flag7", "flag8", "flag9", "flag15", "flag16", "flag18", "flag20", "flag24", "flag39", "flag45", "flag47", "flag48", "flag49", "flag50", "flag51", "flag52", "flag57", "flag59", "flag62", "flag64", "flag80", "flag82", "flag83", "flag84", "flag85", "flag86", "flag89", "flag90", "flag91", "flag92", "flag93", "flag94", "flag95", "flag96", "flag97", "flag98", "flag99", "flag100", "flag102", "flag103", "spe3", "spe5", "spe6")
for (i in temp){
  check02$err_flag_P <- if_else(check02[[i]] == "", 1, check02$err_flag_P)
  check02$err_flag_Ps <- if_else(check02[[i]] != "", 1 + check02$err_flag_Ps, check02$err_flag_Ps)
}

check02$err_flag_Ps <- check02$err_flag_Ps %>% as.character()

# check02$err_flag_LC <- 0
# check02$err_flag_LCs <- 0
# temp <- c("flag25", "flag26", "flag29", "flag31", "flag56", "flag58", "flag61", "flag67", "flag68", "flag69", "flag70", "flag74", "flag75", "flag101", "spe4")
# for (i in temp){
#   check02$err_flag_LC <- if_else(check02[[i]] == "", 1, check02$err_flag_LC)
#   check02$err_flag_LCs <- if_else(check02[[i]] != "", 1 + check02$err_flag_LCs, check02$err_flag_LCs)
# }
# 
# check02$err_flag_LCs <- check02$err_flag_LCs %>% as.character()

check02$flag_P_txt <- if_else(
  check02$err_flag_P == 0, "貴處室提供的資料，沒有檢查出需要修正之處。謝謝貴處室協助完成填報工作，請等待其他處室重新上傳資料，如果處室間資料比對有誤，系統會再發信通知。謝謝！",
  paste0("經本計畫複檢，仍發現共有",  check02$err_flag_Ps,  "個可能需要修正之處，懇請貴處室協助增補，尚祈見諒！修正後的檔案需重新完成整個填報流程。如有疑問，請與本計畫人員聯繫，謝謝！")
  )

# check02$flag_LC_txt <- if_else(
#   check02$err_flag_LC == 0, "貴處室提供的資料，沒有檢查出需要修正之處。謝謝貴處室協助完成填報工作，請等待其他處室重新上傳資料，如果處室間資料比對有誤，系統會再發信通知。謝謝！",
#   paste0("經本計畫複檢，仍發現共有",  check02$err_flag_LCs,  "個可能需要修正之處，懇請貴處室協助增補，尚祈見諒！修正後的檔案需重新完成整個填報流程。如有疑問，請與本計畫人員聯繫，謝謝！")
# )

temp <- c("flag1", "flag2", "flag3", "flag6", "flag7", "flag8", "flag9", "flag15", "flag16", "flag18", "flag20", "flag24", "flag39", "flag45", "flag47", "flag48", "flag49", "flag50", "flag51", "flag52", "flag57", "flag59", "flag62", "flag64", "flag80", "flag82", "flag83", "flag84", "flag85", "flag86", "flag89", "flag90", "flag91", "flag92", "flag93", "flag94", "flag95", "flag96", "flag97", "flag98", "flag99", "flag100", "flag102", "flag103", "spe3", "spe5", "spe6")
for (i in temp){
  for (j in 1:dim(check02)[1]){
    check02[[i]][j] <- if_else(check02[[i]][j] == "", "通過", check02[[i]][j])
  }
}

check02 <- check02 %>%
  subset(select = -c(err_flag, err_flag_P, err_flag_Ps))
write.csv(check02, file = "C:\\edhr-113t2\\work\\edhr-113t2-check_print.csv", row.names = FALSE)
}else{
  write.csv(check02, file = "C:\\edhr-113t2\\work\\edhr-113t2-check_print.csv", row.names = FALSE)
}

#####自動化檢誤#####
#若全部學校皆未上傳(print檔案不存在 或 自己管區的學校皆未上傳)，以下皆不執行
if(!file.exists(checkfile_server) | #print檔案不存在
   (check02 %>% select("organization_id") %>% subset(organization_id %in% dis) %>% dim())[1] == 0) # 或 自己管區的學校皆未上傳
{
  print(paste(format(time_now, format = "%Y/%m/%d %H:%M"), " 本次無學校上傳", sep = ""))
}else
{
  #####自動化通知 - 每小時通知<本次上傳學校名單、需補正學校名單、三階檢通過學校名單>#####
  #初次執行需建立pre_list_agree和pre_correct_list兩個xlsx檔，用if else來做
  #若xlsx檔不存在，建立檔案
  if(!file.exists("C:/edhr-113t2/dta/edhr_113t2_202504/pre_list_agree.xlsx"))
  {
    #建立pre_list_agree.xlsx
    pre_list_agree <- list_agree
    openxlsx :: write.xlsx(pre_list_agree, file = "C:/edhr-113t2/dta/edhr_113t2_202504/pre_list_agree.xlsx", rowNames = FALSE, overwrite = TRUE)
    #建立pre_correct_list.xlsx
    correct_list <- read.table("C:\\edhr-113t2\\work\\edhr-113t2-check_print.csv", header = TRUE, sep = ",", colClasses = "character") %>% #本次需補正學校
      subset(select = c(organization_id, edu_name2))
    correct_list$edu_name2 <- paste(correct_list$edu_name2, "(", correct_list$organization_id, ")", sep = "")
    correct_list <- correct_list %>%
      mutate(pre_correct = 1)
    #以下是為了解決無法合併的問題
    if(dim(correct_list)[1] == 0)
    {
      correct_list[1, 1 : 2] = "0"
      colnames(correct_list) <- c("organization_id", "edu_name2", "pre_correct")
    }else
    {
      correct_list = correct_list
    }
    openxlsx :: write.xlsx(correct_list, file = "C:/edhr-113t2/dta/edhr_113t2_202504/pre_correct_list.xlsx", rowNames = FALSE, overwrite = TRUE)
  }else
  {
    print("pre_list_agree和pre_correct_list兩個xlsx檔存在，繼續執行")
  }
  
  #若xlsx檔存在，執行
  if(file.exists("C:/edhr-113t2/dta/edhr_113t2_202504/pre_list_agree.xlsx"))
  {
    #讀取上次名單
    pre_list_agree <- readxl :: read_excel("C:/edhr-113t2/dta/edhr_113t2_202504/pre_list_agree.xlsx")
    pre_list_agree$organization_id <- as.character(pre_list_agree$organization_id)
    pre_correct_list <- readxl :: read_excel("C:/edhr-113t2/dta/edhr_113t2_202504/pre_correct_list.xlsx")
    pre_correct_list <- mutate(pre_correct_list, pre_correct = 1)
    #以下是為了解決pre_list_agree無法合併的問題(若出現此問題只會發生在list_agree為空 且 pre_list_agree為空)
    if(dim(pre_list_agree)[1] == 0 & dim(list_agree)[1] == 0)
    {
      pre_list_agree <- list_agree
    }else
    {
      pre_list_agree = pre_list_agree
    }
    
    #本次上傳 - 本次出現但上次沒出現
    organization <- readxl :: read_excel("\\\\192.168.110.245\\Plan_edhr\\教育部高級中等學校教育人力資源資料庫建置第8期計畫(1130801_1140731)\\1132全國學校名單.xls") %>% #[每次填報更改]本次填報的學校名單檔案路徑
      select("學校代碼", "學校名稱") %>%
      rename(organization_id = 學校代碼, edu_name = 學校名稱) %>%
      rename(name = edu_name)
    compare_list <- left_join(list_agree, pre_list_agree, by = c("organization_id")) %>%
      subset(is.na(agree.y))
    compare_list <- merge(x = compare_list, y = organization, by = "organization_id", all.x = TRUE)
    #以下是為了解決compare_list為0
    if(dim(compare_list)[1] == 0)
    {
      compare_list[1, 1 : 4] = 0
    }else
    {
      compare_list = compare_list
    }
    compare_list$name <- paste(compare_list$name, "(", compare_list$organization_id, ")", sep = "")
    
    #本次上傳 - 本次出現且上次出現且出現在上次需修正名單(compare_correct_list的意思是在這次上傳期間未處理上次未通過的學校)
    compare_correct_list <- left_join(list_agree, pre_correct_list, by = c("organization_id")) %>%
      subset(pre_correct == 1)
    #以下是為了解決compare_correct_list為0
    if(dim(compare_correct_list)[1] == 0)
    {
      compare_correct_list[1, c(1, 3)] = "0"
      compare_correct_list[1, c(2, 4)] = 0
    }else
    {
      compare_correct_list = compare_correct_list
    }
    
    #compare_correct_list$edu_name2 <- paste(compare_correct_list$edu_name2, "(", compare_correct_list$organization_id, ")", sep = "")
    #另存'本次已上傳名單"，以便於與下次名單比對
    pre_list_agree <- list_agree
    openxlsx :: write.xlsx(pre_list_agree, file = "C:/edhr-113t2/dta/edhr_113t2_202504/pre_list_agree.xlsx", rowNames = FALSE, overwrite = TRUE)
    
    correct_list <- read.table("C:\\edhr-113t2\\work\\edhr-113t2-check_print.csv", header = TRUE, sep = ",", colClasses = "character") %>% #本次需補正學校
      subset(select = c(organization_id, edu_name2))
    correct_list_c <- correct_list %>%
      subset(select = c(organization_id))
    correct_list$edu_name2 <- paste(correct_list$edu_name2, "(", correct_list$organization_id, ")", sep = "")
    
    #處理correct_list為tibble的問題
    if(dim(correct_list)[1] == 0){
      correct_list <- data.frame(
        organization_id = c(""), 
        edu_name2 = c("")
      )
      correct_list <- correct_list[-1, ]
    }else{
      correct_list <- correct_list
    }
    #將correct_list_c 變數的data type改為char
    if(is.character(correct_list_c$organization_id)){
      correct_list_c <- correct_list_c
    }else{
      correct_list_c <- correct_list_c %>% mutate(across(organization_id, as.character))
    }
    correct_list <- left_join(compare_list, correct_list, by = c("organization_id")) %>%
      subset(select = c(organization_id, edu_name2)) %>%
      subset(!is.na(edu_name2))
    correct_list_2 <- left_join(correct_list_c, compare_correct_list, by = c("organization_id")) %>%
      subset(select = c(organization_id, edu_name2, pre_correct)) %>%
      subset(pre_correct == 1)
    correct_list <- bind_rows(correct_list, correct_list_2)
    correct <- apply(as.data.frame(correct_list$edu_name2), 2, paste, collapse = ", ")
    
    #用stata將學校三階檢未通過改為通過之處理
    #出現在上次需修正名單(pre_correct_list) 且未出現在本次需修正名單(correct_list) 且出現在compare_correct_list，則從compare_correct_list刪除
    #也就是我不要pre_correct_list == 1 & is.na(correct_list) & compare_correct_list == 1
    compare_correct_list <- compare_correct_list %>%
      mutate(compare_correct_list = 1)
    pre_correct_list_c <- pre_correct_list %>%
      mutate(pre_correct_list = 1)
    correct_list_c <- correct_list
    #以下是為了解決correct_list_c無法合併的問題
    if(dim(correct_list_c)[1] == 0)
    {
      correct_list_c[1, 1 : 2] = 0
      colnames(correct_list_c) <- c("organization_id", "edu_name2", "pre_correct")
    }else
    {
      correct_list_c = correct_list_c
    }
    correct_list_c <- correct_list_c %>%
      mutate(correct_list = 1)
    compare_correct_list <- merge(x = compare_correct_list, y = pre_correct_list_c, by = "organization_id", all = TRUE)
    compare_correct_list <- merge(x = compare_correct_list, y = correct_list_c, by = "organization_id", all = TRUE)
    compare_correct_list <- compare_correct_list %>%
      subset(compare_correct_list != 1 | pre_correct != 1 | !is.na(correct_list)) #By De Morgan' s Laws, (A交集B交集C)的補集合 = A補集合或B補集合或C補集合
    compare_correct_list <- compare_correct_list %>%
      subset(select = c(organization_id, agree, edu_name2.x, pre_correct.x)) %>%
      rename(edu_name2 = edu_name2.x, pre_correct = pre_correct.x)
    
    #以下是為了解決無法合併的問題
    if(dim(correct_list)[1] == 0)
    {
      correct_list[1, 1 : 2] = 0
      colnames(correct_list) <- c("organization_id", "edu_name2", "pre_correct")
    }else
    {
      correct_list = correct_list
    }
    
    #以下是為了解決correct開頭為","
    str_corr <- str_locate(correct, ",")[ ,1]
    
    if(is.na(str_corr))
    {
      str_corr = " "
    }else
    {
      str_corr = str_corr
    }
    
    if(str_corr == 1)
    {
      correct = substr(correct, start = 2, stop = nchar(correct))  
    }else
    {
      correct = correct
    }
    
    #建立表格內容會用到的學校名單
    now <- apply(as.data.frame(compare_list$name), 2, paste, collapse = ", ") #本次上傳學校
    #以下是為了解決now為0(0)
    if(now == "0(0)")
    {
      now = ""
    }else
    {
      now = now
    }
    now <- paste(now, apply(as.data.frame(compare_correct_list$edu_name2), 2, paste, collapse = ", "), sep = ", ")
    
    #以下是為了解決now開頭為","
    str_now <- str_locate(now, ",")[ ,1]
    
    if(is.na(str_now))
    {
      str_now = " "
    }else
    {
      str_now = str_now
    }
    
    if(str_now == 1)
    {
      now = substr(now, start = 2, stop = nchar(now))  
    }else
    {
      now = now
    }
    #以下是為了解決now為0
    if(now == "0")
    {
      now = ""
    }else
    {
      now = now
    }
    
    #以下是為了解決now為 0
    if(now == " 0")
    {
      now = ""
    }else
    {
      now = now
    }
    
    #以下是為了解決now結尾為", 0"
    str_now <- str_locate(now, ", 0")[ ,1]
    
    if(!is.na(str_now) & now != "")
    {
      now = substr(now, start = 1, stop = nchar(now) - 3)
    }else
    {
      now = now
    }
    
    #以下是為了解決now結尾為", NA"
    if(is.na(str_locate(now, ", NA")[ ,1])){
      now = now
    }else if(str_locate(now, ", NA")[ ,1] == nchar(now) - 3){
      now = substr(now, start = 1, stop = nchar(now) - 4)
    }else{
      now = now
    }
    
    #另存'本次需修正名單"，以便於與下次名單比對
    openxlsx :: write.xlsx(correct_list, file = "C:/edhr-113t2/dta/edhr_113t2_202504/pre_correct_list.xlsx", rowNames = FALSE, overwrite = TRUE)
    
    clear_list <- left_join(compare_list, correct_list, by = c("organization_id")) %>% #本次三階檢通過學校
      subset(select = c(organization_id, edu_name2, name)) %>%
      subset(is.na(edu_name2)) 
    clear <-apply(as.data.frame(clear_list$name), 2, paste, collapse = ", ")
    clear_correct_list <- merge(x = correct_list, y = pre_correct_list, by = c("organization_id"), all = TRUE) %>%
      subset(is.na(edu_name2.x)) %>%
      subset(select = c(organization_id, edu_name2.y))
    clear_correct_list <- merge(x = clear_correct_list , y = pre_correct_list, by = c("organization_id"), all.x = TRUE) %>%  #clear_correct_list: 沒出現在correct_list 且出現在pre_correct_list，可能為(1)本次通過且上次未通過 或(2)本次被退件且上次未通過，需排除(2)，也就是clear_correct_list的名單若也出現在pre_correct_list，需排除
      subset(is.na(edu_name2)) %>%
      subset(select = c(organization_id, edu_name2.y))
    #以下是為了解決clear_correct_list為0
    if(dim(clear_correct_list)[1] == 0)
    {
      clear_correct_list[1, 1 : 2] = 0
    }else
    {
      clear_correct_list = clear_correct_list
    }
    
    clear_correct_list$edu_name2.y <- substr(clear_correct_list$edu_name2.y, start = 1, stop = str_locate(clear_correct_list$edu_name2.y, pattern = "\\(")[1, 1] - 1)
    clear_correct_list$edu_name2.y <- paste(clear_correct_list$edu_name2.y, "(", clear_correct_list$organization_id, ")", sep = "")
    clear_2 <-apply(as.data.frame(clear_correct_list$edu_name2.y), 2, paste, collapse = ", ")
    clear <- paste(clear, clear_2, sep = ",")
    
    #以下是為了解決clear開頭為","
    if(str_locate(clear, ",")[ ,1] == 1)
    {
      clear = substr(clear, start = 2, stop = nchar(clear))  
    }else
    {
      clear = clear
    }
    
    #以下是為了解決"0(0)"
    if(now == "0(0)")
    {
      now = ""
    }else
    {
      now = now
    }
    
    #以下是為了解決now中間出現NA
    now <- gsub(", NA", "", now)
    
    if(correct == "0(0)")
    {
      correct = ""
    }else
    {
      correct = correct
    }
    
    #以下是為了解決"NA(0)"
    if(clear == "NA(0)")
    {
      clear = ""
    }else
    {
      clear = clear
    }
    
    #以下是為了解決clear出現,NA(0)
    clear <- gsub(",NA\\(0\\)", "", clear)
    
    #以下是為了解決clear為"0(0)"
    if(clear == "0(0)")
    {
      clear = ""
    }else
    {
      clear = clear
    }
    
    #以下是為了解決now為" NA"
    now <- gsub(" NA", "", now)
    
    #excel視窗通知
    #先判斷check_print檔案是否使用中(以"是否可更改檔案名稱"來判斷 若可更改 代表未使用中)
    checkprint_filename <- "C:\\edhr-113t2\\work\\edhr-113t2-check_print.csv"
    checkprint_filename_2 <- substr(checkprint_filename, start = 1, stop = str_locate(checkprint_filename, ".csv")[ ,1] - 1)  
    
    if(file.rename(from = checkprint_filename, to = paste(checkprint_filename_2, "2.csv", sep = "")) == TRUE)
    {
      if(nchar(now) == 0)
      {
        file.rename(from = paste(checkprint_filename_2, "2.csv", sep = ""), to = checkprint_filename)
        
        paste(format(time_now, format = "%Y/%m/%d %H:%M"), " 本次無學校上傳", sep = "")
      }else
      {
        #存入xlsx，自動開啟
        #建立檔案名稱
        correct_filename_year <- substr(title, start = str_locate(title, "學年度")[ ,1] - 3, stop = str_locate(title, "學年度")[ ,1] - 1)
        if(substr(title, start = str_locate(title, "學期")[ ,1] - 1, stop = str_locate(title, "學期")[ ,1] - 1) == "上")
        {
          correct_filename_sem <- "1"
        }else{
          correct_filename_sem <- "2"
        }
        correct_filename_name <- substr(title, start = str_locate(title, "（")[ ,1] + 1, stop = str_locate(title, "）")[ ,1] - 1)
        correct_filename <- paste(correct_filename_year, correct_filename_sem, correct_filename_name, "_上傳名單", sep = "")
        
        #建立fileopen.bat fileclose.bat
        write.table(paste("start C:\\autochecking\\",correct_filename, ".xlsx", sep = ""), file = "C:\\autochecking\\fileopen.bat", append = FALSE, quote = FALSE, col.names = FALSE, row.names = FALSE, fileEncoding = "BIG5")
        write.table(paste("taskkill /FI \"WINDOWTITLE eq ", correct_filename, "*\"", sep = ""), file = "C:\\autochecking\\fileclose.bat", append = FALSE, quote = FALSE, col.names = FALSE, row.names = FALSE, fileEncoding = "BIG5")
        
        if(!file.exists(paste("C:\\autochecking\\",correct_filename, ".xlsx", sep = "")))
        {
          #如果檔案不存在
          # 建立 Excel 活頁簿
          wb <- createWorkbook()
          
          # 設定框線樣式
          options("openxlsx.borderColour" = "#4F80BD")
          options("openxlsx.borderStyle" = "thin")
          
          # 設定 Excel 活頁簿預設字型
          modifyBaseFont(wb, fontSize = 20, fontName = "Arial")
          
          # 新增工作表
          addWorksheet(wb, sheetName = "上傳名單", gridLines = FALSE)
          
          # 建立上傳學校名單表格
          body <- data.frame(matrix(0, 1, 4))
          colnames(body) <- c("上傳時間", "本次上傳學校", "本次需補正學校", "本次三階檢通過學校")
          body[1, ] <- c(format(time_now, format = "%Y/%m/%d %H:%M"), now, correct, clear)
          
          # 建立樣式
          headSty <- createStyle(fontSize = 22, fgFill="#DCE6F1", halign="center", border = "TopBottomLeftRight", wrapText = TRUE)
          
          # 將學校名單表格寫入
          txtSty <- createStyle(halign="left", valign = "center", border = "TopBottomLeftRight", wrapText = TRUE)
          writeData(wb, 1, x = body, startCol = "A", startRow=1, borders="rows", headerStyle = headSty)
          addStyle(wb, sheet = 1, style = txtSty, cols = 1:4, rows = 2:(dim(body)[1]+1), gridExpand = TRUE)
          
          # 設定欄寬
          setColWidths(wb, 1, cols=1, widths = 16)
          setColWidths(wb, 1, cols=2:5, widths = 20)
          
          # 儲存 Excel 活頁簿
          saveWorkbook(wb, paste("C:\\autochecking\\",correct_filename, ".xlsx", sep = ""), overwrite = TRUE)
          
          # excel檔開啟30秒後自動關閉
          time_a <- Sys.time()
          a <- as.numeric(format(time_a, format = "%M")) * 60 + as.numeric(format(time_a, format = "%S"))      
          shell.exec("C:\\autochecking\\fileopen.bat")
          
          b <- a
          while (b - a < 30)
          {
            time_b <- Sys.time()
            b <- as.numeric(format(time_b, format = "%M")) * 60 + as.numeric(format(time_b, format = "%S"))
          }
          
          if(!file.exists("C:\\autochecking\\fileclose.bat"))
          {
            write.table(paste("taskkill /FI \"WINDOWTITLE eq ", correct_filename, "*\"", sep = ""), file = "C:\\autochecking\\fileclose.bat", append = FALSE, quote = FALSE, col.names = FALSE, row.names = FALSE, fileEncoding = "BIG5")
          }else
          {
            print("建立fileclose.bat檔案")
          }
          
          shell.exec("C:\\autochecking\\fileclose.bat")
        }else{
          #如果檔案存在
          # 建立 Excel 活頁簿
          wb <- createWorkbook()
          
          # 設定框線樣式
          options("openxlsx.borderColour" = "#4F80BD")
          options("openxlsx.borderStyle" = "thin")
          
          # 設定 Excel 活頁簿預設字型
          modifyBaseFont(wb, fontSize = 20, fontName = "Arial")
          
          # 新增工作表
          addWorksheet(wb, sheetName = "上傳名單", gridLines = FALSE)
          
          # 建立上傳學校名單表格
          body <- readxl :: read_excel(paste("C:\\autochecking\\",correct_filename, ".xlsx", sep = ""))
          body <- rbind(c("0", "0", "0", "0"), body)
          colnames(body) <- c("上傳時間", "本次上傳學校", "本次需補正學校", "本次三階檢通過學校")
          body[1, ] <- as.list(c(format(time_now, format = "%Y/%m/%d %H:%M"), now, correct, clear))
          
          # 建立樣式
          headSty <- createStyle(fontSize = 22, fgFill="#DCE6F1", halign="center", border = "TopBottomLeftRight", wrapText = TRUE)
          
          # 將學校名單表格寫入
          txtSty <- createStyle(halign="left", valign = "center", border = "TopBottomLeftRight", wrapText = TRUE)
          writeData(wb, 1, x = body, startCol = "A", startRow=1, borders="rows", headerStyle = headSty)
          addStyle(wb, sheet = 1, style = txtSty, cols = 1:4, rows = 2:(dim(body)[1]+1), gridExpand = TRUE)
          
          # 設定欄寬
          setColWidths(wb, 1, cols=1, widths = 16)
          setColWidths(wb, 1, cols=2:5, widths = 20)
          
          # 儲存 Excel 活頁簿
          saveWorkbook(wb, paste("C:\\autochecking\\",correct_filename, ".xlsx", sep = ""), overwrite = TRUE)
          
          # excel檔開啟30秒後自動關閉
          time_a <- Sys.time()
          a <- as.numeric(format(time_a, format = "%M")) * 60 + as.numeric(format(time_a, format = "%S"))      
          shell.exec("C:\\autochecking\\fileopen.bat")
          
          b <- a
          while (b - a < 30)
          {
            time_b <- Sys.time()
            b <- as.numeric(format(time_b, format = "%M")) * 60 + as.numeric(format(time_b, format = "%S"))
          }
          
          write.table(paste("taskkill /FI \"WINDOWTITLE eq ", correct_filename, "*\"", sep = ""), file = "C:\\autochecking\\fileclose.bat", append = FALSE, quote = FALSE, col.names = FALSE, row.names = FALSE, fileEncoding = "BIG5")
          
          shell.exec("C:\\autochecking\\fileclose.bat")
          
          file.rename(from = "C:\\edhr-113t2\\work\\edhr-113t2-check_print2.csv", to = "C:\\edhr-113t2\\work\\edhr-113t2-check_print.csv")
        }
      }
    }else
    {
      #建立errortext_fileopen.bat
      if(!file.exists("C:\\autochecking\\errortext_fileopen.bat"))
      {
        write.table("start C:\\autochecking\\errortext_fileopen.xlsx", file = "C:\\autochecking\\errortext_fileopen.bat", append = FALSE, quote = FALSE, col.names = FALSE, row.names = FALSE, fileEncoding = "BIG5")
        print("建立errortext_fileopen.bat檔案")
      }else
      {
        print("errortext_fileopen.bat檔案存在")
      }
      
      #如果檔案不存在
      # 建立 Excel 活頁簿
      wb <- createWorkbook()
      
      # 設定框線樣式
      options("openxlsx.borderColour" = "#4F80BD")
      options("openxlsx.borderStyle" = "thin")
      
      # 設定 Excel 活頁簿預設字型
      modifyBaseFont(wb, fontSize = 20, fontName = "Arial")
      
      # 新增工作表
      addWorksheet(wb, sheetName = "上傳名單", gridLines = FALSE)
      
      # 建立上傳學校名單表格
      body <- "本次自動化檢核未執行，請盡速關閉檢核報告word檔，自動化檢核方可繼續執行。閱讀完畢請關閉此檔案。"
      
      # 建立樣式
      headSty <- createStyle(fontSize = 22, fgFill="#DCE6F1", halign="center", border = "TopBottomLeftRight", wrapText = TRUE)
      
      # 將學校名單表格寫入
      txtSty <- createStyle(halign="left", valign = "center", border = "TopBottomLeftRight", wrapText = TRUE)
      writeData(wb, 1, x = body, startCol = "A", startRow=1, borders="rows", headerStyle = headSty)
      addStyle(wb, sheet = 1, style = txtSty, cols = 1:5, rows = 1, gridExpand = TRUE)
      mergeCells(wb, sheet = 1, cols = 1:5, rows = 1:1)
      
      # 設定欄寬
      setColWidths(wb, 1, cols=1, widths = 16)
      setColWidths(wb, 1, cols=2:5, widths = 20)
      
      # 儲存 Excel 活頁簿
      saveWorkbook(wb, "C:\\autochecking\\errortext_fileopen.xlsx", overwrite = TRUE)
      shell.exec("C:\\autochecking\\errortext_fileopen.bat")
    }
  }else
  {
    print("pre_list_agree和pre_correct_list兩個xlsx檔不存在")
  }
}
